             CMD        PROMPT('When constants vary')

             PARM       KWD(TEXT) TYPE(*CHAR) LEN(25) +
                          DFT('$´^~#@[\]{|}!') PROMPT('Text string')

             PARM       KWD(BIN) TYPE(*CHAR) LEN(25) +
                          DFT(X'5BBEB0A17B7CBAE0BBC04FD05A') +
                          PROMPT('same string, binary value')



