    ? *=------------------------------------------------------------------------------------------=*
    ? *
    ? *  If you need to change anything in this code, feed back !
    ? *  so, I will take care of the update in next version
    ? *  link to : contact at page http://jplamontre.free.fr/jpltools.htm
    ? *=------------------------------------------------------------------------------------------=*
    ?d* public prototypes are defines in /include
    ?d* private prototypes and workfields are here
     D PdfFileHandle   s             10i 0
     D pdftoCode       ds                  qualified
     D         ccsid                 10i 0 inz(500)
     D         convA                 10i 0                                      ignored
     D         subA                  10i 0                                      ignored
     D         shftA                 10i 0                                      ignored
     D         lnOpt                 10i 0                                      ignored
     D         erOpt                 10i 0                                      ignored
     D         res                   12a   inz(*ALLx'00')
     D pdffromCode     ds                  qualified
     D          ccsid                10i 0 inz(0)
     D          convA                10i 0 inz(0)                               Ibm Defined
     D          subA                 10i 0 inz(0)                               no rtn nb substitutn
     D          shftA                10i 0 inz(1)                               restore shift state
     D          lnOpt                10i 0 inz(0)                               P1 len is in P2
     D          erOpt                10i 0 inz(0)                               cvt DBCS to CDRA
     D          res                  12a   inz(*ALLx'00')
    ? *                convert from jobccsid to latin1 IE 0 to 1252
     D pdfhIconvLatin1...
     D                 ds                  likeds(iconv_t) inz
    ? *                convert from jobccsid to UTF16  IE 0 to 1200
     D pdfhIconvU16    ds                  likeds(iconv_t) inz
    ? *                convert from UTF8     to Latin1 IE 1208 to 1252
     D pdfhIconvU8Latin1...
     D                 ds                  likeds(iconv_t) inz
    ? *                convert from UTF16    to Latin1 IE 1200 to 1252
     D pdfhIconvU16Latin1...
     D                 ds                  likeds(iconv_t) inz
    ? *                convert from UTF8     to UTF16  IE 1208 to 1200
     D pdfhIconvU8U16  ds                  likeds(iconv_t) inz
     D PdfBytesCount   S             10i 0

     d PdfBuffer       s                   like(PdfS3)
     d PdfBuffLen      s             10i 0 inz(%size(PdfBuffer))
     D PdfFile         ds                  qualified
     d    version                          like(pdfs1)
     d    first                            like(pdfobj)
     d    size                             like(pdfobj)
     d    root                             like(pdfobj)
     d    info                             like(pdfobj)
     d    creator                          like(pdfs1)
     d    creationdate...
     d                                     like(pdfs1)
     d    title                            like(pdfs1)
     d    producer                         like(pdfs1)
     d    author                           like(pdfs1)
     d    drawCurrX                        like(pdfobj)
     d    drawCurrY                        like(pdfobj)
     d    textCurrX                        like(pdfobj)
     d    textCurrY                        like(pdfobj)
     d    CurrFont                     *
     d    CurrFontSize...
     d                                     like(pdfobj)
    ?d    FontStack                    *   dim(20)
    ?d    iFontStack                  5i00
     d    CurrCondSize...
     d                                     like(pdfobj)
     d    FileName                         like(pdfS2 )
    ?d****xref                             like(pdfobj) dim(15123)
     d    StartXref                        like(pdfobj)
     d    withDiag                     n
     d    Encrypted                    n
     d    encrypt                          like(pdfobj)
     d    FileId                     32
     d    UserKey                    64
     d    OwnerKey                   64
     d    Permission                  5i 0
     d    CurrObj                    10i 0
     d    EncryptionKeyBase...
     d                               16
     d    EncryptionRevision...
     d                                1
     d    AllocXref                        like(pdfobj)                         allocated size
     d    RandomSeed                 10i 0
     d PdfXrefArray    s          65535    based(pPdfXrefArray)
     d PdfXref         ds                  based(pPdfXref) qualified
     d   obj                               like(PdfObj)
     D PdfRoot         ds                  qualified
     d    Obj                              like(pdfobj)
     d    Outlines                         like(pdfobj)
     d    Pages                            like(pdfobj)
     D PdfOutlines     ds                  qualified
     d    Obj                              like(pdfobj)
     d    Count                            like(pdfobj)
     d    First                            like(pdfobj)
     d    Next                             like(pdfobj)
     d    Last                             like(pdfobj)
     d    LastPage                         like(pdfobj)
     D PdfPages        ds                  qualified
     d    Obj                              like(pdfobj)
     d    Count                            like(pdfobj)
    ?d*** Kids                             like(pdfobj) dim(5000)
     d    AllocKids                        like(pdfobj)                         allocated size
     d PdfKidsArray    s          65535    based(pPdfKidsArray)
     d PdfKids         ds                  based(pPdfKids) qualified
     d   obj                               like(PdfObj)
     D PdfPage         ds                  qualified
     d    Obj                              like(pdfobj)
     d    Parent                           like(pdfobj)
     d    Resource                         like(pdfobj)
     d    MediaBox                         like(pdfobj) dim(4)
     d    Margin                           like(pdfobj) dim(4)
     d    Content                          like(pdfobj)
     d    Title                            like(pdfs1 )
     d    IsOpen                       n
     d    TextIsOpen                   n
     D fontsStr        DS
     D                               23A   INZ('/Helvetica             ')
     D                               23A   INZ('/Helvetica-Bold        ')
     D                               23A   INZ('/Helvetica-Oblique     ')
     D                               23A   INZ('/Helvetica-BoldOblique ')
     D                               23A   INZ('/Times-Roman           ')
     D                               23A   INZ('/Times-Bold            ')
     D                               23A   INZ('/Times-Italic          ')
     D                               23A   INZ('/Times-BoldItalic      ')
     D                               23A   INZ('/Courier               ')
     D                               23A   INZ('/Courier-Bold          ')
     D                               23A   INZ('/Courier-Oblique       ')
     D                               23A   INZ('/Courier-BoldOblique   ')
     D                               23A   INZ('/Symbol                ')
     D                               23A   INZ('/ZapfDingbats          ')

     D FONTSTRING                    23A   OVERLAY(fontsStr) DIM(14)

    ? * liste des caractères connus
    ? * TODO - faire une correction de CCSID. Cette liste est en CCSID 037
    ? * le code ascii de x'20' à x'ff' copié collé provoque un gros trou dans la liste
    ? * ce qui s'explique facilement : la partie imprimable de l'EBCDIC
    ? * comporte 192 caractères (de x'40' à x'ff') quand l'ASCII de windows en
    ? * comporte 224 (de x'20' à x'ff')
    ? *   !"#$%&'()*+,-./  *                            !"#$%&'()*+,-./
    ? *  0123456789:;<=>?  *                           0123456789:;<=>?
    ? *  @ABCDEFGHIJKLMNO  *      ?                    @ABCDEFGHIJKLMNO
    ? *  PQRSTUVWXYZ[\]^_  *                           PQRSTUVWXYZ[\]^_
    ? *  `abcdefghijklmno  *                           `abcdefghijklmno
    ? *  pqrstuvwxyz{|}~   *                           pqrstuvwxyz{|}~
    ? *                    *
    ? *                 ?  *
    ? *   ¡¢£¤¥¦§¨©ª«¬­®¯  *                             ¢£¤¥¦§¨©ª«¬­®¯
    ? *  °±²³´µ¶·¸¹º»¼½¾¿  *                           °±²³´µ¶·¸¹º»¼½¾¿
    ? *  ÀÁÂÃÄÅÆÇÈÉÊËÌÍÎÏ  *                           ÀÁÂÃÄÅÆÇÈÉÊËÌÍÎÏ
    ? *  ÐÑÒÓÔÕÖ×ØÙÚÛÜÝÞß  *                           ÐÑÒÓÔÕÖ×ØÙÚÛÜÝÞß
    ? *  àáâãäåæçèéêëìíîï  *                           àáâãäåæçèéêëìíîï
    ? *  ðñòóôõö÷øùúûüýþÿ  *                           ðñòóôõö÷øùúûüýþÿ
    ? *                    *

     d CharListInz     DS           224    qualified
    ?d* list of characters défined in the reader fonts
    ?d* information found at ftp://ftp.adobe.com/pub/adobe/type/  in atm3afm.zip
     D SPACE                          3u 0 inz(x'20')
     D EXCLAMATION                    3u 0 inz(x'21')
     D QUOTATION_MARK                 3u 0 inz(x'22')
     D NUMBER_SIGN                    3u 0 inz(x'23')
     D DOLLAR_SIGN                    3u 0 inz(x'24')
     D PERCENT_SIGN                   3u 0 inz(x'25')
     D AMPERSAND                      3u 0 inz(x'26')
     D APOSTROPHE                     3u 0 inz(x'27')
     D L_PARENTHESIS                  3u 0 inz(x'28')
     D R_PARENTHESIS                  3u 0 inz(x'29')
     D ASTERISK                       3u 0 inz(x'2A')
     D PLUS_SIGN                      3u 0 inz(x'2B')
     D COMMA                          3u 0 inz(x'2C')
     D HYPHEN_MINUS                   3u 0 inz(x'2D')
     D PERIOD                         3u 0 inz(x'2E')
     D SLASH                          3u 0 inz(x'2F')
     D DIGIT_ZERO                     3u 0 inz(x'30')
     D DIGIT_ONE                      3u 0 inz(x'31')
     D DIGIT_TWO                      3u 0 inz(x'32')
     D DIGIT_THREE                    3u 0 inz(x'33')
     D DIGIT_FOUR                     3u 0 inz(x'34')
     D DIGIT_FIVE                     3u 0 inz(x'35')
     D DIGIT_SIX                      3u 0 inz(x'36')
     D DIGIT_SEVEN                    3u 0 inz(x'37')
     D DIGIT_EIGHT                    3u 0 inz(x'38')
     D DIGIT_NINE                     3u 0 inz(x'39')
     D COLON                          3u 0 inz(x'3A')
     D SEMICOLON                      3u 0 inz(x'3B')
     D LESS_THAN_SIGN                 3u 0 inz(x'3C')
     D EQUALS_SIGN                    3u 0 inz(x'3D')
     D GREATER_THAN                   3u 0 inz(x'3E')
     D QUESTION_MARK                  3u 0 inz(x'3F')
     D COMMERCIAL_AT                  3u 0 inz(x'40')
     D CAPITAL_A                      3u 0 inz(x'41')
     D CAPITAL_B                      3u 0 inz(x'42')
     D CAPITAL_C                      3u 0 inz(x'43')
     D CAPITAL_D                      3u 0 inz(x'44')
     D CAPITAL_E                      3u 0 inz(x'45')
     D CAPITAL_F                      3u 0 inz(x'46')
     D CAPITAL_G                      3u 0 inz(x'47')
     D CAPITAL_H                      3u 0 inz(x'48')
     D CAPITAL_I                      3u 0 inz(x'49')
     D CAPITAL_J                      3u 0 inz(x'4A')
     D CAPITAL_K                      3u 0 inz(x'4B')
     D CAPITAL_L                      3u 0 inz(x'4C')
     D CAPITAL_M                      3u 0 inz(x'4D')
     D CAPITAL_N                      3u 0 inz(x'4E')
     D CAPITAL_O                      3u 0 inz(x'4F')
     D CAPITAL_P                      3u 0 inz(x'50')
     D CAPITAL_Q                      3u 0 inz(x'51')
     D CAPITAL_R                      3u 0 inz(x'52')
     D CAPITAL_S                      3u 0 inz(x'53')
     D CAPITAL_T                      3u 0 inz(x'54')
     D CAPITAL_U                      3u 0 inz(x'55')
     D CAPITAL_V                      3u 0 inz(x'56')
     D CAPITAL_W                      3u 0 inz(x'57')
     D CAPITAL_X                      3u 0 inz(x'58')
     D CAPITAL_Y                      3u 0 inz(x'59')
     D CAPITAL_Z                      3u 0 inz(x'5A')
     D LEFT_BRACKET                   3u 0 inz(x'5B')
     D BACKSLASH                      3u 0 inz(x'5C')
     D RIGHT_BRACKET                  3u 0 inz(x'5D')
     D CIRCUMFLEX_ACC                 3u 0 inz(x'5E')
     D UNDERSCORE                     3u 0 inz(x'5F')
     D GRAVE_ACCENT                   3u 0 inz(x'60')
     D SML_A                          3u 0 inz(x'61')
     D SML_B                          3u 0 inz(x'62')
     D SML_C                          3u 0 inz(x'63')
     D SML_D                          3u 0 inz(x'64')
     D SML_E                          3u 0 inz(x'65')
     D SML_F                          3u 0 inz(x'66')
     D SML_G                          3u 0 inz(x'67')
     D SML_H                          3u 0 inz(x'68')
     D SML_I                          3u 0 inz(x'69')
     D SML_J                          3u 0 inz(x'6A')
     D SML_K                          3u 0 inz(x'6B')
     D SML_L                          3u 0 inz(x'6C')
     D SML_M                          3u 0 inz(x'6D')
     D SML_N                          3u 0 inz(x'6E')
     D SML_O                          3u 0 inz(x'6F')
     D SML_P                          3u 0 inz(x'70')
     D SML_Q                          3u 0 inz(x'71')
     D SML_R                          3u 0 inz(x'72')
     D SML_S                          3u 0 inz(x'73')
     D SML_T                          3u 0 inz(x'74')
     D SML_U                          3u 0 inz(x'75')
     D SML_V                          3u 0 inz(x'76')
     D SML_W                          3u 0 inz(x'77')
     D SML_X                          3u 0 inz(x'78')
     D SML_Y                          3u 0 inz(x'79')
     D SML_Z                          3u 0 inz(x'7A')
     D LEFT_BRACE                     3u 0 inz(x'7B')
     D VERTICAL_LINE                  3u 0 inz(x'7C')
     D RIGHT_BRACE                    3u 0 inz(x'7D')
     D ASCIITILDE                     3u 0 inz(x'7E')
     D DELETE                         3u 0 inz(x'7F')
     D Euro                           3u 0 inz(x'80')
     D x81                            3u 0 inz(x'81')
     D x82                            3u 0 inz(x'82')
     D florin                         3u 0 inz(x'83')
     D quotedblbase                   3u 0 inz(x'84')
     D x85                            3u 0 inz(x'85')
     D dagger                         3u 0 inz(x'86')
     D daggerdbl                      3u 0 inz(x'87')
     D circumflex                     3u 0 inz(x'88')
     D perthousand                    3u 0 inz(x'89')
     D CapScaron                      3u 0 inz(x'8a')
     D guilsinglleft                  3u 0 inz(x'8b')
     D cap_OE                         3u 0 inz(x'8c')
     D x8d                            3u 0 inz(x'8d')
     D Cap_Zcaron                     3u 0 inz(x'8e')
     D x8f                            3u 0 inz(x'8f')
     D x90                            3u 0 inz(x'90')
     D quoteleft                      3u 0 inz(x'91')
     D quoteright                     3u 0 inz(x'92')
     D quotedblleft                   3u 0 inz(x'93')
     D quotedblright                  3u 0 inz(x'94')
     D bullet                         3u 0 inz(x'95')
     D underline                      3u 0 inz(x'96')
     D dbl_underline                  3u 0 inz(x'97')
     D Tilde                          3u 0 inz(x'98')
     D trademark                      3u 0 inz(x'99')
     D Sml_scaron                     3u 0 inz(x'9a')
     D guilsinglright                 3u 0 inz(x'9b')
     D sml_oe                         3u 0 inz(x'9c')
     D x9d                            3u 0 inz(x'9d')
     D sml_zcaron                     3u 0 inz(x'9e')
     D Ydieresis                      3u 0 inz(x'9f')
     D NO_BREAK_SPACE                 3u 0 inz(x'A0')
     D INVERTED_EXCLA                 3u 0 inz(x'A1')
     D CENT_SIGN                      3u 0 inz(x'A2')
     D POUND_SIGN                     3u 0 inz(x'A3')
     D CURRENCY_SIGN                  3u 0 inz(x'A4')
     D YEN_SIGN                       3u 0 inz(x'A5')
     D BROKEN_BAR                     3u 0 inz(x'A6')
     D SECTION_SIGN                   3u 0 inz(x'A7')
     D DIAERESIS                      3u 0 inz(x'A8')
     D COPYRIGHT_SIGN                 3u 0 inz(x'A9')
     D FEMININE_ORDIN                 3u 0 inz(x'AA')
     D L_DBL_QUOTE                    3u 0 inz(x'AB')
     D NOT_SIGN                       3u 0 inz(x'AC')
     D SOFT_HYPHEN                    3u 0 inz(x'AD')
     D REGISTERED                     3u 0 inz(x'AE')
     D MACRON                         3u 0 inz(x'AF')
     D DEGREE_SIGN                    3u 0 inz(x'B0')
     D PLUS_MINUS                     3u 0 inz(x'B1')
     D SUPER_TWO                      3u 0 inz(x'B2')
     D SUPER_THREE                    3u 0 inz(x'B3')
     D ACUTE_ACCENT                   3u 0 inz(x'B4')
     D MICRO_SIGN                     3u 0 inz(x'B5')
     D PARAGRAPH_sign                 3u 0 inz(x'B6')
     D MIDDLE_DOT                     3u 0 inz(x'B7')
     D CEDILLA                        3u 0 inz(x'B8')
     D SUPER_ONE                      3u 0 inz(x'B9')
     D MASCULINE_ORDI                 3u 0 inz(x'BA')
     D R_DBL_QUOTE                    3u 0 inz(x'BB')
     D ONE_QUARTER                    3u 0 inz(x'BC')
     D ONE_HALF                       3u 0 inz(x'BD')
     D THREE_QUARTERS                 3u 0 inz(x'BE')
     D INVERTED_QUEST                 3u 0 inz(x'BF')
     D CAP_A_GRAVE                    3u 0 inz(x'C0')
     D CAP_A_ACUTE                    3u 0 inz(x'C1')
     D CAP_A_CIRCUMFL                 3u 0 inz(x'C2')
     D CAP_A_TILDE                    3u 0 inz(x'C3')
     D CAP_A_DIAERESI                 3u 0 inz(x'C4')
     D CAP_A_RING_ABO                 3u 0 inz(x'C5')
     D CAP_AE                         3u 0 inz(x'C6')
     D CAP_C_CEDILLA                  3u 0 inz(x'C7')
     D CAP_E_GRAVE                    3u 0 inz(x'C8')
     D CAP_E_ACUTE                    3u 0 inz(x'C9')
     D CAP_E_CIRCUMFL                 3u 0 inz(x'CA')
     D CAP_E_DIAERESI                 3u 0 inz(x'CB')
     D CAP_I_GRAVE                    3u 0 inz(x'CC')
     D CAP_I_ACUTE                    3u 0 inz(x'CD')
     D CAP_I_CIRCUMFL                 3u 0 inz(x'CE')
     D CAP_I_DIAERESI                 3u 0 inz(x'CF')
     D CAP_ETH                        3u 0 inz(x'D0')
     D CAP_N_TILDE                    3u 0 inz(x'D1')
     D CAP_O_GRAVE                    3u 0 inz(x'D2')
     D CAP_O_ACUTE                    3u 0 inz(x'D3')
     D CAP_O_CIRCUMFL                 3u 0 inz(x'D4')
     D CAP_O_TILDE                    3u 0 inz(x'D5')
     D CAP_O_DIAERESI                 3u 0 inz(x'D6')
     D MULTIPLICATION                 3u 0 inz(x'D7')
     D CAP_O_SLASH                    3u 0 inz(x'D8')
     D CAP_U_GRAVE                    3u 0 inz(x'D9')
     D CAP_U_ACUTE                    3u 0 inz(x'DA')
     D CAP_U_CIRCUMFL                 3u 0 inz(x'DB')
     D CAP_U_DIAERESI                 3u 0 inz(x'DC')
     D CAP_Y_ACUTE                    3u 0 inz(x'DD')
     D CAP_THORN                      3u 0 inz(x'DE')
     D SML_SHARP_S                    3u 0 inz(x'DF')
     D SML_A_GRAVE                    3u 0 inz(x'e0')
     D SML_A_ACUTE                    3u 0 inz(x'e1')
     D SML_A_CIRCUMFL                 3u 0 inz(x'e2')
     D SML_A_TILDE                    3u 0 inz(x'e3')
     D SML_A_DIAERESI                 3u 0 inz(x'e4')
     D SML_A_RING_ABO                 3u 0 inz(x'e5')
     D SML_AE                         3u 0 inz(x'e6')
     D SML_C_CEDILLA                  3u 0 inz(x'e7')
     D SML_E_GRAVE                    3u 0 inz(x'e8')
     D SML_E_ACUTE                    3u 0 inz(x'e9')
     D SML_E_CIRCUMFL                 3u 0 inz(x'EA')
     D SML_E_DIAERESI                 3u 0 inz(x'EB')
     D SML_I_GRAVE                    3u 0 inz(x'EC')
     D SML_I_ACUTE                    3u 0 inz(x'ED')
     D SML_I_CIRCUMFL                 3u 0 inz(x'EE')
     D SML_I_DIAERESI                 3u 0 inz(x'EF')
     D SML_ETH                        3u 0 inz(x'F0')
     D SML_N_TILDE                    3u 0 inz(x'F1')
     D SML_O_GRAVE                    3u 0 inz(x'F2')
     D SML_O_ACUTE                    3u 0 inz(x'F3')
     D SML_O_CIRCUMFL                 3u 0 inz(x'F4')
     D SML_O_TILDE                    3u 0 inz(x'F5')
     D SML_O_DIAERESI                 3u 0 inz(x'F6')
     D DIVISION_SIGN                  3u 0 inz(x'F7')
     D SML_O_SLASH                    3u 0 inz(x'F8')
     D SML_U_GRAVE                    3u 0 inz(x'F9')
     D SML_U_ACUTE                    3u 0 inz(x'FA')
     D SML_U_CIRCUMFL                 3u 0 inz(x'FB')
     D SML_U_DIAERESI                 3u 0 inz(x'FC')
     D SML_Y_ACUTE                    3u 0 inz(x'FD')
     D SML_THORN                      3u 0 inz(x'FE')
     D SML_Y_DIAERESI                 3u 0 inz(x'FF')

     d CharList        ds                  qualified
     d   char                         1    dim(224)

     d HVR             ds           448    qualified
    ? * Helvetica
     D SPACE                          5u 0 inz(278)
     D EXCLAMATION                    5u 0 inz(278)
     D QUOTATION_MARK                 5u 0 inz(355)
     D NUMBER_SIGN                    5u 0 inz(556)
     D DOLLAR_SIGN                    5u 0 inz(556)
     D PERCENT_SIGN                   5u 0 inz(889)
     D AMPERSAND                      5u 0 inz(667)
     D APOSTROPHE                     5u 0 inz(192)
     D L_PARENTHESIS                  5u 0 inz(333)
     D R_PARENTHESIS                  5u 0 inz(333)
     D ASTERISK                       5u 0 inz(389)
     D PLUS_SIGN                      5u 0 inz(584)
     D COMMA                          5u 0 inz(278)
     D HYPHEN_MINUS                   5u 0 inz(333)
     D PERIOD                         5u 0 inz(278)
     D SLASH                          5u 0 inz(278)
     D DIGIT_ZERO                     5u 0 inz(556)
     D DIGIT_ONE                      5u 0 inz(556)
     D DIGIT_TWO                      5u 0 inz(556)
     D DIGIT_THREE                    5u 0 inz(556)
     D DIGIT_FOUR                     5u 0 inz(556)
     D DIGIT_FIVE                     5u 0 inz(556)
     D DIGIT_SIX                      5u 0 inz(556)
     D DIGIT_SEVEN                    5u 0 inz(556)
     D DIGIT_EIGHT                    5u 0 inz(556)
     D DIGIT_NINE                     5u 0 inz(556)
     D COLON                          5u 0 inz(278)
     D SEMICOLON                      5u 0 inz(278)
     D LESS_THAN_SIGN                 5u 0 inz(584)
     D EQUALS_SIGN                    5u 0 inz(584)
     D GREATER_THAN                   5u 0 inz(584)
     D QUESTION_MARK                  5u 0 inz(556)
     D COMMERCIAL_AT                  5u 0 inz(1015)
     D CAPITAL_A                      5u 0 inz(667)
     D CAPITAL_B                      5u 0 inz(667)
     D CAPITAL_C                      5u 0 inz(725)
     D CAPITAL_D                      5u 0 inz(725)
     D CAPITAL_E                      5u 0 inz(667)
     D CAPITAL_F                      5u 0 inz(610)
     D CAPITAL_G                      5u 0 inz(777)
     D CAPITAL_H                      5u 0 inz(730)
     D CAPITAL_I                      5u 0 inz(280)
     D CAPITAL_J                      5u 0 inz(500)
     D CAPITAL_K                      5u 0 inz(667)
     D CAPITAL_L                      5u 0 inz(555)
     D CAPITAL_M                      5u 0 inz(835)
     D CAPITAL_N                      5u 0 inz(725)
     D CAPITAL_O                      5u 0 inz(775)
     D CAPITAL_P                      5u 0 inz(667)
     D CAPITAL_Q                      5u 0 inz(777)
     D CAPITAL_R                      5u 0 inz(725)
     D CAPITAL_S                      5u 0 inz(667)
     D CAPITAL_T                      5u 0 inz(610)
     D CAPITAL_U                      5u 0 inz(725)
     D CAPITAL_V                      5u 0 inz(667)
     D CAPITAL_W                      5u 0 inz(945)
     D CAPITAL_X                      5u 0 inz(667)
     D CAPITAL_Y                      5u 0 inz(667)
     D CAPITAL_Z                      5u 0 inz(615)
     D LEFT_BRACKET                   5u 0 inz(278)
     D BACKSLASH                      5u 0 inz(278)
     D RIGHT_BRACKET                  5u 0 inz(278)
     D CIRCUMFLEX_ACC                 5u 0 inz(469)
     D UNDERSCORE                     5u 0 inz(556)
     D GRAVE_ACCENT                   5u 0 inz(333)
     D SML_A                          5u 0 inz(556)
     D SML_B                          5u 0 inz(556)
     D SML_C                          5u 0 inz(500)
     D SML_D                          5u 0 inz(556)
     D SML_E                          5u 0 inz(556)
     D SML_F                          5u 0 inz(278)
     D SML_G                          5u 0 inz(556)
     D SML_H                          5u 0 inz(556)
     D SML_I                          5u 0 inz(222)
     D SML_J                          5u 0 inz(222)
     D SML_K                          5u 0 inz(500)
     D SML_L                          5u 0 inz(222)
     D SML_M                          5u 0 inz(833)
     D SML_N                          5u 0 inz(556)
     D SML_O                          5u 0 inz(556)
     D SML_P                          5u 0 inz(556)
     D SML_Q                          5u 0 inz(556)
     D SML_R                          5u 0 inz(333)
     D SML_S                          5u 0 inz(500)
     D SML_T                          5u 0 inz(278)
     D SML_U                          5u 0 inz(556)
     D SML_V                          5u 0 inz(500)
     D SML_W                          5u 0 inz(722)
     D SML_X                          5u 0 inz(500)
     D SML_Y                          5u 0 inz(500)
     D SML_Z                          5u 0 inz(500)
     D LEFT_BRACE                     5u 0 inz(334)
     D VERTICAL_LINE                  5u 0 inz(260)
     D RIGHT_BRACE                    5u 0 inz(334)
     D ASCIITILDE                     5u 0 inz(584)
     D DELETE                         5u 0 inz(350)
     D Euro                           5u 0 inz(560)
     D x81                            5u 0 inz(350)
     D x82                            5u 0 inz(222)
     D florin                         5u 0 inz(556)
     D quotedblbase                   5u 0 inz(333)
     D x85                            5u 0 inz(1000)
     D dagger                         5u 0 inz(556)
     D daggerdbl                      5u 0 inz(556)
     D circumflex                     5u 0 inz(333)
     D perthousand                    5u 0 inz(1000)
     D cap_Scaron                     5u 0 inz(666)
     D guilsinglleft                  5u 0 inz(333)
     D cap_OE                         5u 0 inz(1000)
     D x8d                            5u 0 inz(350)
     D cap_Zcaron                     5u 0 inz(610)
     D x8f                            5u 0 inz(350)
     D x90                            5u 0 inz(350)
     D quoteleft                      5u 0 inz(222)
     D quoteright                     5u 0 inz(222)
     D quotedblleft                   5u 0 inz(333)
     D quotedblright                  5u 0 inz(333)
     D bullet                         5u 0 inz(350)
     D underline                      5u 0 inz(560)
     D dbl_underline                  5u 0 inz(1000)
     D tilde                          5u 0 inz(333)
     D trademark                      5u 0 inz(1000)
     D sml_scaron                     5u 0 inz(500)
     D guilsinglright                 5u 0 inz(333)
     D sml_oe                         5u 0 inz(945)
     D x9d                            5u 0 inz(350)
     D sml_zcaron                     5u 0 inz(500)
     D Ydieresis                      5u 0 inz(667)
     D NO_BREAK_SPACE                 5u 0 inz(275)
     D INVERTED_EXCLA                 5u 0 inz(333)
     D CENT_SIGN                      5u 0 inz(556)
     D POUND_SIGN                     5u 0 inz(556)
     D CURRENCY_SIGN                  5u 0 inz(556)
     D YEN_SIGN                       5u 0 inz(556)
     D BROKEN_BAR                     5u 0 inz(260)
     D SECTION_SIGN                   5u 0 inz(556)
     D DIAERESIS                      5u 0 inz(333)
     D COPYRIGHT_SIGN                 5u 0 inz(737)
     D FEMININE_ORDIN                 5u 0 inz(370)
     D L_DBL_QUOTE                    5u 0 inz(556)
     D NOT_SIGN                       5u 0 inz(585)
     D SOFT_HYPHEN                    5u 0 inz(333)
     D REGISTERED                     5u 0 inz(737)
     D MACRON                         5u 0 inz(333)
     D DEGREE_SIGN                    5u 0 inz(400)
     D PLUS_MINUS                     5u 0 inz(584)
     D SUPER_TWO                      5u 0 inz(333)
     D SUPER_THREE                    5u 0 inz(333)
     D ACUTE_ACCENT                   5u 0 inz(333)
     D MICRO_SIGN                     5u 0 inz(580)
     D PARAGRAPH_SIGN                 5u 0 inz(537)
     D MIDDLE_DOT                     5u 0 inz(278)
     D CEDILLA                        5u 0 inz(333)
     D SUPER_ONE                      5u 0 inz(333)
     D MASCULINE_ORDI                 5u 0 inz(365)
     D R_DBL_QUOTE                    5u 0 inz(556)
     D ONE_QUARTER                    5u 0 inz(834)
     D ONE_HALF                       5u 0 inz(834)
     D THREE_QUARTERS                 5u 0 inz(834)
     D INVERTED_QUEST                 5u 0 inz(611)
     D CAP_A_GRAVE                    5u 0 inz(667)
     D CAP_A_ACUTE                    5u 0 inz(667)
     D CAP_A_CIRCUMFL                 5u 0 inz(667)
     D CAP_A_TILDE                    5u 0 inz(667)
     D CAP_A_DIAERESI                 5u 0 inz(667)
     D CAP_A_RING_ABO                 5u 0 inz(667)
     D CAP_AE                         5u 0 inz(1000)
     D CAP_C_CEDILLA                  5u 0 inz(722)
     D CAP_E_GRAVE                    5u 0 inz(667)
     D CAP_E_ACUTE                    5u 0 inz(667)
     D CAP_E_CIRCUMFL                 5u 0 inz(667)
     D CAP_E_DIAERESI                 5u 0 inz(667)
     D CAP_I_GRAVE                    5u 0 inz(278)
     D CAP_I_ACUTE                    5u 0 inz(278)
     D CAP_I_CIRCUMFL                 5u 0 inz(278)
     D CAP_I_DIAERESI                 5u 0 inz(278)
     D CAP_ETH                        5u 0 inz(722)
     D CAP_N_TILDE                    5u 0 inz(722)
     D CAP_O_GRAVE                    5u 0 inz(778)
     D CAP_O_ACUTE                    5u 0 inz(778)
     D CAP_O_CIRCUMFL                 5u 0 inz(778)
     D CAP_O_TILDE                    5u 0 inz(778)
     D CAP_O_DIAERESI                 5u 0 inz(778)
     D MULTIPLICATION                 5u 0 inz(584)
     D CAP_O_SLASH                    5u 0 inz(778)
     D CAP_U_GRAVE                    5u 0 inz(722)
     D CAP_U_ACUTE                    5u 0 inz(722)
     D CAP_U_CIRCUMFL                 5u 0 inz(722)
     D CAP_U_DIAERESI                 5u 0 inz(722)
     D CAP_Y_ACUTE                    5u 0 inz(667)
     D CAP_THORN                      5u 0 inz(667)
     D SML_SHARP_S                    5u 0 inz(610)
     D SML_A_GRAVE                    5u 0 inz(556)
     D SML_A_ACUTE                    5u 0 inz(556)
     D SML_A_CIRCUMFL                 5u 0 inz(556)
     D SML_A_TILDE                    5u 0 inz(556)
     D SML_A_DIAERESI                 5u 0 inz(556)
     D SML_A_RING_ABO                 5u 0 inz(556)
     D SML_AE                         5u 0 inz(889)
     D SML_C_CEDILLA                  5u 0 inz(500)
     D SML_E_GRAVE                    5u 0 inz(555)
     D SML_E_ACUTE                    5u 0 inz(555)
     D SML_E_CIRCUMFL                 5u 0 inz(555)
     D SML_E_DIAERESI                 5u 0 inz(555)
     D SML_I_GRAVE                    5u 0 inz(278)
     D SML_I_ACUTE                    5u 0 inz(278)
     D SML_I_CIRCUMFL                 5u 0 inz(278)
     D SML_I_DIAERESI                 5u 0 inz(278)
     D SML_ETH                        5u 0 inz(556)
     D SML_N_TILDE                    5u 0 inz(556)
     D SML_O_GRAVE                    5u 0 inz(556)
     D SML_O_ACUTE                    5u 0 inz(556)
     D SML_O_CIRCUMFL                 5u 0 inz(556)
     D SML_O_TILDE                    5u 0 inz(556)
     D SML_O_DIAERESI                 5u 0 inz(556)
     D DIVISION_SIGN                  5u 0 inz(584)
     D SML_O_SLASH                    5u 0 inz(611)
     D SML_U_GRAVE                    5u 0 inz(556)
     D SML_U_ACUTE                    5u 0 inz(556)
     D SML_U_CIRCUMFL                 5u 0 inz(556)
     D SML_U_DIAERESI                 5u 0 inz(556)
     D SML_Y_ACUTE                    5u 0 inz(500)
     D SML_THORN                      5u 0 inz(555)
     D SML_Y_DIAERESI                 5u 0 inz(500)
     d size                           5u 0 dim(224) overlay(hvr )

     d HVB             ds           448    qualified
    ? * Helvetica-Bold
     D SPACE                          5u 0 inz(278)
     D EXCLAMATION                    5u 0 inz(333)
     D QUOTATION_MARK                 5u 0 inz(474)
     D NUMBER_SIGN                    5u 0 inz(556)
     D DOLLAR_SIGN                    5u 0 inz(556)
     D PERCENT_SIGN                   5u 0 inz(889)
     D AMPERSAND                      5u 0 inz(722)
     D APOSTROPHE                     5u 0 inz(238)
     D L_PARENTHESIS                  5u 0 inz(333)
     D R_PARENTHESIS                  5u 0 inz(333)
     D ASTERISK                       5u 0 inz(389)
     D PLUS_SIGN                      5u 0 inz(584)
     D COMMA                          5u 0 inz(278)
     D HYPHEN_MINUS                   5u 0 inz(333)
     D PERIOD                         5u 0 inz(278)
     D SLASH                          5u 0 inz(278)
     D DIGIT_ZERO                     5u 0 inz(556)
     D DIGIT_ONE                      5u 0 inz(556)
     D DIGIT_TWO                      5u 0 inz(556)
     D DIGIT_THREE                    5u 0 inz(556)
     D DIGIT_FOUR                     5u 0 inz(556)
     D DIGIT_FIVE                     5u 0 inz(556)
     D DIGIT_SIX                      5u 0 inz(556)
     D DIGIT_SEVEN                    5u 0 inz(556)
     D DIGIT_EIGHT                    5u 0 inz(556)
     D DIGIT_NINE                     5u 0 inz(556)
     D COLON                          5u 0 inz(333)
     D SEMICOLON                      5u 0 inz(333)
     D LESS_THAN_SIGN                 5u 0 inz(584)
     D EQUALS_SIGN                    5u 0 inz(584)
     D GREATER_THAN                   5u 0 inz(584)
     D QUESTION_MARK                  5u 0 inz(611)
     D COMMERCIAL_AT                  5u 0 inz(975)
     D CAPITAL_A                      5u 0 inz(722)
     D CAPITAL_B                      5u 0 inz(722)
     D CAPITAL_C                      5u 0 inz(722)
     D CAPITAL_D                      5u 0 inz(722)
     D CAPITAL_E                      5u 0 inz(667)
     D CAPITAL_F                      5u 0 inz(611)
     D CAPITAL_G                      5u 0 inz(778)
     D CAPITAL_H                      5u 0 inz(722)
     D CAPITAL_I                      5u 0 inz(278)
     D CAPITAL_J                      5u 0 inz(556)
     D CAPITAL_K                      5u 0 inz(722)
     D CAPITAL_L                      5u 0 inz(611)
     D CAPITAL_M                      5u 0 inz(833)
     D CAPITAL_N                      5u 0 inz(722)
     D CAPITAL_O                      5u 0 inz(778)
     D CAPITAL_P                      5u 0 inz(667)
     D CAPITAL_Q                      5u 0 inz(778)
     D CAPITAL_R                      5u 0 inz(722)
     D CAPITAL_S                      5u 0 inz(667)
     D CAPITAL_T                      5u 0 inz(611)
     D CAPITAL_U                      5u 0 inz(722)
     D CAPITAL_V                      5u 0 inz(667)
     D CAPITAL_W                      5u 0 inz(944)
     D CAPITAL_X                      5u 0 inz(667)
     D CAPITAL_Y                      5u 0 inz(667)
     D CAPITAL_Z                      5u 0 inz(611)
     D LEFT_BRACKET                   5u 0 inz(333)
     D BACKSLASH                      5u 0 inz(278)
     D RIGHT_BRACKET                  5u 0 inz(333)
     D CIRCUMFLEX_ACC                 5u 0 inz(584)
     D UNDERSCORE                     5u 0 inz(556)
     D GRAVE_ACCENT                   5u 0 inz(333)
     D SML_A                          5u 0 inz(556)
     D SML_B                          5u 0 inz(611)
     D SML_C                          5u 0 inz(556)
     D SML_D                          5u 0 inz(611)
     D SML_E                          5u 0 inz(556)
     D SML_F                          5u 0 inz(333)
     D SML_G                          5u 0 inz(611)
     D SML_H                          5u 0 inz(611)
     D SML_I                          5u 0 inz(278)
     D SML_J                          5u 0 inz(278)
     D SML_K                          5u 0 inz(555)
     D SML_L                          5u 0 inz(278)
     D SML_M                          5u 0 inz(888)
     D SML_N                          5u 0 inz(611)
     D SML_O                          5u 0 inz(611)
     D SML_P                          5u 0 inz(611)
     D SML_Q                          5u 0 inz(611)
     D SML_R                          5u 0 inz(389)
     D SML_S                          5u 0 inz(555)
     D SML_T                          5u 0 inz(333)
     D SML_U                          5u 0 inz(611)
     D SML_V                          5u 0 inz(556)
     D SML_W                          5u 0 inz(778)
     D SML_X                          5u 0 inz(556)
     D SML_Y                          5u 0 inz(556)
     D SML_Z                          5u 0 inz(500)
     D LEFT_BRACE                     5u 0 inz(389)
     D VERTICAL_LINE                  5u 0 inz(280)
     D RIGHT_BRACE                    5u 0 inz(389)
     D ASCIITILDE                     5u 0 inz(584)
     D DELETE                         5u 0 inz(350)
     D Euro                           5u 0 inz(556)
     D x81                            5u 0 inz(350)
     D x82                            5u 0 inz(282)
     D florin                         5u 0 inz(556)
     D quotedblbase                   5u 0 inz(500)
     D x85                            5u 0 inz(1000)
     D dagger                         5u 0 inz(556)
     D daggerdbl                      5u 0 inz(556)
     D circumflex                     5u 0 inz(333)
     D perthousand                    5u 0 inz(1000)
     D cap_Scaron                     5u 0 inz(666)
     D guilsinglleft                  5u 0 inz(333)
     D cap_OE                         5u 0 inz(1000)
     D x8d                            5u 0 inz(350)
     D cap_Zcaron                     5u 0 inz(611)
     D x8f                            5u 0 inz(350)
     D x90                            5u 0 inz(350)
     D quoteleft                      5u 0 inz(282)
     D quoteright                     5u 0 inz(282)
     D quotedblleft                   5u 0 inz(500)
     D quotedblright                  5u 0 inz(500)
     D bullet                         5u 0 inz(350)
     D underline                      5u 0 inz(556)
     D dbl_underline                  5u 0 inz(1000)
     D tilde                          5u 0 inz(333)
     D trademark                      5u 0 inz(1000)
     D sml_scaron                     5u 0 inz(556)
     D guilsinglright                 5u 0 inz(333)
     D sml_oe                         5u 0 inz(950)
     D x9d                            5u 0 inz(350)
     D sml_zcaron                     5u 0 inz(500)
     D Ydieresis                      5u 0 inz(667)
     D NO_BREAK_SPACE                 5u 0 inz(280)
     D INVERTED_EXCLA                 5u 0 inz(333)
     D CENT_SIGN                      5u 0 inz(556)
     D POUND_SIGN                     5u 0 inz(556)
     D CURRENCY_SIGN                  5u 0 inz(556)
     D YEN_SIGN                       5u 0 inz(556)
     D BROKEN_BAR                     5u 0 inz(282)
     D SECTION_SIGN                   5u 0 inz(556)
     D DIAERESIS                      5u 0 inz(333)
     D COPYRIGHT_SIGN                 5u 0 inz(737)
     D FEMININE_ORDIN                 5u 0 inz(370)
     D L_DBL_QUOTE                    5u 0 inz(556)
     D NOT_SIGN                       5u 0 inz(582)
     D SOFT_HYPHEN                    5u 0 inz(333)
     D REGISTERED                     5u 0 inz(737)
     D MACRON                         5u 0 inz(333)
     D DEGREE_SIGN                    5u 0 inz(400)
     D PLUS_MINUS                     5u 0 inz(584)
     D SUPER_TWO                      5u 0 inz(333)
     D SUPER_THREE                    5u 0 inz(333)
     D ACUTE_ACCENT                   5u 0 inz(333)
     D MICRO_SIGN                     5u 0 inz(611)
     D PARAGRAPH_sIGN                 5u 0 inz(556)
     D MIDDLE_DOT                     5u 0 inz(278)
     D CEDILLA                        5u 0 inz(333)
     D SUPER_ONE                      5u 0 inz(333)
     D MASCULINE_ORDI                 5u 0 inz(365)
     D R_DBL_QUOTE                    5u 0 inz(556)
     D ONE_QUARTER                    5u 0 inz(834)
     D ONE_HALF                       5u 0 inz(834)
     D THREE_QUARTERS                 5u 0 inz(834)
     D INVERTED_QUEST                 5u 0 inz(611)
     D CAP_A_GRAVE                    5u 0 inz(722)
     D CAP_A_ACUTE                    5u 0 inz(722)
     D CAP_A_CIRCUMFL                 5u 0 inz(722)
     D CAP_A_TILDE                    5u 0 inz(722)
     D CAP_A_DIAERESI                 5u 0 inz(722)
     D CAP_A_RING_ABO                 5u 0 inz(722)
     D CAP_AE                         5u 0 inz(1000)
     D CAP_C_CEDILLA                  5u 0 inz(722)
     D CAP_E_GRAVE                    5u 0 inz(667)
     D CAP_E_ACUTE                    5u 0 inz(667)
     D CAP_E_CIRCUMFL                 5u 0 inz(667)
     D CAP_E_DIAERESI                 5u 0 inz(667)
     D CAP_I_GRAVE                    5u 0 inz(278)
     D CAP_I_ACUTE                    5u 0 inz(278)
     D CAP_I_CIRCUMFL                 5u 0 inz(278)
     D CAP_I_DIAERESI                 5u 0 inz(278)
     D CAP_ETH                        5u 0 inz(722)
     D CAP_N_TILDE                    5u 0 inz(722)
     D CAP_O_GRAVE                    5u 0 inz(778)
     D CAP_O_ACUTE                    5u 0 inz(778)
     D CAP_O_CIRCUMFL                 5u 0 inz(778)
     D CAP_O_TILDE                    5u 0 inz(778)
     D CAP_O_DIAERESI                 5u 0 inz(778)
     D MULTIPLICATION                 5u 0 inz(584)
     D CAP_O_SLASH                    5u 0 inz(778)
     D CAP_U_GRAVE                    5u 0 inz(722)
     D CAP_U_ACUTE                    5u 0 inz(722)
     D CAP_U_CIRCUMFL                 5u 0 inz(722)
     D CAP_U_DIAERESI                 5u 0 inz(722)
     D CAP_Y_ACUTE                    5u 0 inz(667)
     D CAP_THORN                      5u 0 inz(667)
     D SML_SHARP_S                    5u 0 inz(611)
     D SML_A_GRAVE                    5u 0 inz(556)
     D SML_A_ACUTE                    5u 0 inz(556)
     D SML_A_CIRCUMFL                 5u 0 inz(556)
     D SML_A_TILDE                    5u 0 inz(556)
     D SML_A_DIAERESI                 5u 0 inz(556)
     D SML_A_RING_ABO                 5u 0 inz(556)
     D SML_AE                         5u 0 inz(889)
     D SML_C_CEDILLA                  5u 0 inz(556)
     D SML_E_GRAVE                    5u 0 inz(556)
     D SML_E_ACUTE                    5u 0 inz(556)
     D SML_E_CIRCUMFL                 5u 0 inz(556)
     D SML_E_DIAERESI                 5u 0 inz(556)
     D SML_I_GRAVE                    5u 0 inz(278)
     D SML_I_ACUTE                    5u 0 inz(278)
     D SML_I_CIRCUMFL                 5u 0 inz(278)
     D SML_I_DIAERESI                 5u 0 inz(278)
     D SML_ETH                        5u 0 inz(611)
     D SML_N_TILDE                    5u 0 inz(611)
     D SML_O_GRAVE                    5u 0 inz(611)
     D SML_O_ACUTE                    5u 0 inz(611)
     D SML_O_CIRCUMFL                 5u 0 inz(611)
     D SML_O_TILDE                    5u 0 inz(611)
     D SML_O_DIAERESI                 5u 0 inz(611)
     D DIVISION_SIGN                  5u 0 inz(584)
     D SML_O_SLASH                    5u 0 inz(611)
     D SML_U_GRAVE                    5u 0 inz(611)
     D SML_U_ACUTE                    5u 0 inz(611)
     D SML_U_CIRCUMFL                 5u 0 inz(611)
     D SML_U_DIAERESI                 5u 0 inz(611)
     D SML_Y_ACUTE                    5u 0 inz(556)
     D SML_THORN                      5u 0 inz(611)
     D SML_Y_DIAERESI                 5u 0 inz(556)
     d size                           5u 0 dim(224) overlay(HVB )

     d HVBI            ds           448    qualified
    ? * Helvetica-BoldOblique
     D SPACE                          5u 0 inz(278)
     D EXCLAMATION                    5u 0 inz(333)
     D QUOTATION_MARK                 5u 0 inz(474)
     D NUMBER_SIGN                    5u 0 inz(556)
     D DOLLAR_SIGN                    5u 0 inz(556)
     D PERCENT_SIGN                   5u 0 inz(889)
     D AMPERSAND                      5u 0 inz(722)
     D APOSTROPHE                     5u 0 inz(238)
     D L_PARENTHESIS                  5u 0 inz(333)
     D R_PARENTHESIS                  5u 0 inz(333)
     D ASTERISK                       5u 0 inz(389)
     D PLUS_SIGN                      5u 0 inz(584)
     D COMMA                          5u 0 inz(278)
     D HYPHEN_MINUS                   5u 0 inz(333)
     D PERIOD                         5u 0 inz(278)
     D SLASH                          5u 0 inz(278)
     D DIGIT_ZERO                     5u 0 inz(556)
     D DIGIT_ONE                      5u 0 inz(556)
     D DIGIT_TWO                      5u 0 inz(556)
     D DIGIT_THREE                    5u 0 inz(556)
     D DIGIT_FOUR                     5u 0 inz(556)
     D DIGIT_FIVE                     5u 0 inz(556)
     D DIGIT_SIX                      5u 0 inz(556)
     D DIGIT_SEVEN                    5u 0 inz(556)
     D DIGIT_EIGHT                    5u 0 inz(556)
     D DIGIT_NINE                     5u 0 inz(556)
     D COLON                          5u 0 inz(333)
     D SEMICOLON                      5u 0 inz(333)
     D LESS_THAN_SIGN                 5u 0 inz(584)
     D EQUALS_SIGN                    5u 0 inz(584)
     D GREATER_THAN                   5u 0 inz(584)
     D QUESTION_MARK                  5u 0 inz(611)
     D COMMERCIAL_AT                  5u 0 inz(975)
     D CAPITAL_A                      5u 0 inz(722)
     D CAPITAL_B                      5u 0 inz(722)
     D CAPITAL_C                      5u 0 inz(722)
     D CAPITAL_D                      5u 0 inz(722)
     D CAPITAL_E                      5u 0 inz(667)
     D CAPITAL_F                      5u 0 inz(611)
     D CAPITAL_G                      5u 0 inz(778)
     D CAPITAL_H                      5u 0 inz(722)
     D CAPITAL_I                      5u 0 inz(278)
     D CAPITAL_J                      5u 0 inz(556)
     D CAPITAL_K                      5u 0 inz(722)
     D CAPITAL_L                      5u 0 inz(611)
     D CAPITAL_M                      5u 0 inz(833)
     D CAPITAL_N                      5u 0 inz(722)
     D CAPITAL_O                      5u 0 inz(778)
     D CAPITAL_P                      5u 0 inz(667)
     D CAPITAL_Q                      5u 0 inz(778)
     D CAPITAL_R                      5u 0 inz(722)
     D CAPITAL_S                      5u 0 inz(667)
     D CAPITAL_T                      5u 0 inz(611)
     D CAPITAL_U                      5u 0 inz(722)
     D CAPITAL_V                      5u 0 inz(667)
     D CAPITAL_W                      5u 0 inz(944)
     D CAPITAL_X                      5u 0 inz(667)
     D CAPITAL_Y                      5u 0 inz(667)
     D CAPITAL_Z                      5u 0 inz(611)
     D LEFT_BRACKET                   5u 0 inz(333)
     D BACKSLASH                      5u 0 inz(278)
     D RIGHT_BRACKET                  5u 0 inz(333)
     D CIRCUMFLEX_ACC                 5u 0 inz(584)
     D UNDERSCORE                     5u 0 inz(556)
     D GRAVE_ACCENT                   5u 0 inz(333)
     D SML_A                          5u 0 inz(556)
     D SML_B                          5u 0 inz(611)
     D SML_C                          5u 0 inz(556)
     D SML_D                          5u 0 inz(611)
     D SML_E                          5u 0 inz(556)
     D SML_F                          5u 0 inz(333)
     D SML_G                          5u 0 inz(611)
     D SML_H                          5u 0 inz(611)
     D SML_I                          5u 0 inz(278)
     D SML_J                          5u 0 inz(278)
     D SML_K                          5u 0 inz(556)
     D SML_L                          5u 0 inz(278)
     D SML_M                          5u 0 inz(889)
     D SML_N                          5u 0 inz(611)
     D SML_O                          5u 0 inz(611)
     D SML_P                          5u 0 inz(611)
     D SML_Q                          5u 0 inz(611)
     D SML_R                          5u 0 inz(389)
     D SML_S                          5u 0 inz(556)
     D SML_T                          5u 0 inz(333)
     D SML_U                          5u 0 inz(611)
     D SML_V                          5u 0 inz(556)
     D SML_W                          5u 0 inz(778)
     D SML_X                          5u 0 inz(556)
     D SML_Y                          5u 0 inz(556)
     D SML_Z                          5u 0 inz(500)
     D LEFT_BRACE                     5u 0 inz(389)
     D VERTICAL_LINE                  5u 0 inz(280)
     D RIGHT_BRACE                    5u 0 inz(389)
     D ASCIITILDE                     5u 0 inz(584)
     D DELETE                         5u 0 inz(350)
     D Euro                           5u 0 inz(556)
     D x81                            5u 0 inz(350)
     D x82                            5u 0 inz(280)
     D florin                         5u 0 inz(556)
     D quotedblbase                   5u 0 inz(500)
     D x85                            5u 0 inz(1000)
     D dagger                         5u 0 inz(556)
     D daggerdbl                      5u 0 inz(556)
     D circumflex                     5u 0 inz(333)
     D perthousand                    5u 0 inz(1000)
     D cap_Scaron                     5u 0 inz(667)
     D guilsinglleft                  5u 0 inz(333)
     D cap_OE                         5u 0 inz(1000)
     D x8d                            5u 0 inz(350)
     D cap_Zcaron                     5u 0 inz(611)
     D x8f                            5u 0 inz(350)
     D x90                            5u 0 inz(350)
     D quoteleft                      5u 0 inz(278)
     D quoteright                     5u 0 inz(278)
     D quotedblleft                   5u 0 inz(500)
     D quotedblright                  5u 0 inz(500)
     D bullet                         5u 0 inz(350)
     D underline                      5u 0 inz(556)
     D dbl_underline                  5u 0 inz(1000)
     D tilde                          5u 0 inz(333)
     D trademark                      5u 0 inz(1000)
     D sml_scaron                     5u 0 inz(556)
     D guilsinglright                 5u 0 inz(333)
     D sml_oe                         5u 0 inz(945)
     D x9d                            5u 0 inz(350)
     D sml_zcaron                     5u 0 inz(500)
     D Ydieresis                      5u 0 inz(667)
     D NO_BREAK_SPACE                 5u 0 inz(277)
     D INVERTED_EXCLA                 5u 0 inz(333)
     D CENT_SIGN                      5u 0 inz(556)
     D POUND_SIGN                     5u 0 inz(556)
     D CURRENCY_SIGN                  5u 0 inz(556)
     D YEN_SIGN                       5u 0 inz(556)
     D BROKEN_BAR                     5u 0 inz(280)
     D SECTION_SIGN                   5u 0 inz(556)
     D DIAERESIS                      5u 0 inz(333)
     D COPYRIGHT_SIGN                 5u 0 inz(737)
     D FEMININE_ORDIN                 5u 0 inz(370)
     D L_DBL_QUOTE                    5u 0 inz(556)
     D NOT_SIGN                       5u 0 inz(582)
     D SOFT_HYPHEN                    5u 0 inz(333)
     D REGISTERED                     5u 0 inz(737)
     D MACRON                         5u 0 inz(333)
     D DEGREE_SIGN                    5u 0 inz(400)
     D PLUS_MINUS                     5u 0 inz(584)
     D SUPER_TWO                      5u 0 inz(333)
     D SUPER_THREE                    5u 0 inz(333)
     D ACUTE_ACCENT                   5u 0 inz(333)
     D MICRO_SIGN                     5u 0 inz(611)
     D PARAGRAPH_SIGN                 5u 0 inz(556)
     D MIDDLE_DOT                     5u 0 inz(278)
     D CEDILLA                        5u 0 inz(333)
     D SUPER_ONE                      5u 0 inz(333)
     D MASCULINE_ORDI                 5u 0 inz(365)
     D R_DBL_QUOTE                    5u 0 inz(556)
     D ONE_QUARTER                    5u 0 inz(834)
     D ONE_HALF                       5u 0 inz(834)
     D THREE_QUARTERS                 5u 0 inz(834)
     D INVERTED_QUEST                 5u 0 inz(611)
     D CAP_A_GRAVE                    5u 0 inz(722)
     D CAP_A_ACUTE                    5u 0 inz(722)
     D CAP_A_CIRCUMFL                 5u 0 inz(722)
     D CAP_A_TILDE                    5u 0 inz(722)
     D CAP_A_DIAERESI                 5u 0 inz(722)
     D CAP_A_RING_ABO                 5u 0 inz(722)
     D CAP_AE                         5u 0 inz(1000)
     D CAP_C_CEDILLA                  5u 0 inz(722)
     D CAP_E_GRAVE                    5u 0 inz(667)
     D CAP_E_ACUTE                    5u 0 inz(667)
     D CAP_E_CIRCUMFL                 5u 0 inz(667)
     D CAP_E_DIAERESI                 5u 0 inz(667)
     D CAP_I_GRAVE                    5u 0 inz(278)
     D CAP_I_ACUTE                    5u 0 inz(278)
     D CAP_I_CIRCUMFL                 5u 0 inz(278)
     D CAP_I_DIAERESI                 5u 0 inz(278)
     D CAP_ETH                        5u 0 inz(722)
     D CAP_N_TILDE                    5u 0 inz(722)
     D CAP_O_GRAVE                    5u 0 inz(778)
     D CAP_O_ACUTE                    5u 0 inz(778)
     D CAP_O_CIRCUMFL                 5u 0 inz(778)
     D CAP_O_TILDE                    5u 0 inz(778)
     D CAP_O_DIAERESI                 5u 0 inz(778)
     D MULTIPLICATION                 5u 0 inz(584)
     D CAP_O_SLASH                    5u 0 inz(778)
     D CAP_U_GRAVE                    5u 0 inz(722)
     D CAP_U_ACUTE                    5u 0 inz(722)
     D CAP_U_CIRCUMFL                 5u 0 inz(722)
     D CAP_U_DIAERESI                 5u 0 inz(722)
     D CAP_Y_ACUTE                    5u 0 inz(667)
     D CAP_THORN                      5u 0 inz(667)
     D SML_SHARP_S                    5u 0 inz(611)
     D SML_A_GRAVE                    5u 0 inz(556)
     D SML_A_ACUTE                    5u 0 inz(556)
     D SML_A_CIRCUMFL                 5u 0 inz(556)
     D SML_A_TILDE                    5u 0 inz(556)
     D SML_A_DIAERESI                 5u 0 inz(556)
     D SML_A_RING_ABO                 5u 0 inz(556)
     D SML_AE                         5u 0 inz(889)
     D SML_C_CEDILLA                  5u 0 inz(556)
     D SML_E_GRAVE                    5u 0 inz(556)
     D SML_E_ACUTE                    5u 0 inz(556)
     D SML_E_CIRCUMFL                 5u 0 inz(556)
     D SML_E_DIAERESI                 5u 0 inz(556)
     D SML_I_GRAVE                    5u 0 inz(278)
     D SML_I_ACUTE                    5u 0 inz(278)
     D SML_I_CIRCUMFL                 5u 0 inz(278)
     D SML_I_DIAERESI                 5u 0 inz(278)
     D SML_ETH                        5u 0 inz(611)
     D SML_N_TILDE                    5u 0 inz(611)
     D SML_O_GRAVE                    5u 0 inz(611)
     D SML_O_ACUTE                    5u 0 inz(611)
     D SML_O_CIRCUMFL                 5u 0 inz(611)
     D SML_O_TILDE                    5u 0 inz(611)
     D SML_O_DIAERESI                 5u 0 inz(611)
     D DIVISION_SIGN                  5u 0 inz(584)
     D SML_O_SLASH                    5u 0 inz(611)
     D SML_U_GRAVE                    5u 0 inz(611)
     D SML_U_ACUTE                    5u 0 inz(611)
     D SML_U_CIRCUMFL                 5u 0 inz(611)
     D SML_U_DIAERESI                 5u 0 inz(611)
     D SML_Y_ACUTE                    5u 0 inz(556)
     D SML_THORN                      5u 0 inz(611)
     D SML_Y_DIAERESI                 5u 0 inz(556)
     d size                           5u 0 dim(224) overlay(HVBI)

     d HVO             ds           448    qualified
    ? * Helvetica-Oblique
     D SPACE                          5u 0 inz(278)
     D EXCLAMATION                    5u 0 inz(278)
     D QUOTATION_MARK                 5u 0 inz(355)
     D NUMBER_SIGN                    5u 0 inz(556)
     D DOLLAR_SIGN                    5u 0 inz(556)
     D PERCENT_SIGN                   5u 0 inz(889)
     D AMPERSAND                      5u 0 inz(667)
     D APOSTROPHE                     5u 0 inz(192)
     D L_PARENTHESIS                  5u 0 inz(333)
     D R_PARENTHESIS                  5u 0 inz(333)
     D ASTERISK                       5u 0 inz(389)
     D PLUS_SIGN                      5u 0 inz(584)
     D COMMA                          5u 0 inz(278)
     D HYPHEN_MINUS                   5u 0 inz(333)
     D PERIOD                         5u 0 inz(278)
     D SLASH                          5u 0 inz(278)
     D DIGIT_ZERO                     5u 0 inz(556)
     D DIGIT_ONE                      5u 0 inz(556)
     D DIGIT_TWO                      5u 0 inz(556)
     D DIGIT_THREE                    5u 0 inz(556)
     D DIGIT_FOUR                     5u 0 inz(556)
     D DIGIT_FIVE                     5u 0 inz(556)
     D DIGIT_SIX                      5u 0 inz(556)
     D DIGIT_SEVEN                    5u 0 inz(556)
     D DIGIT_EIGHT                    5u 0 inz(556)
     D DIGIT_NINE                     5u 0 inz(556)
     D COLON                          5u 0 inz(278)
     D SEMICOLON                      5u 0 inz(278)
     D LESS_THAN_SIGN                 5u 0 inz(584)
     D EQUALS_SIGN                    5u 0 inz(584)
     D GREATER_THAN                   5u 0 inz(584)
     D QUESTION_MARK                  5u 0 inz(556)
     D COMMERCIAL_AT                  5u 0 inz(1015)
     D CAPITAL_A                      5u 0 inz(667)
     D CAPITAL_B                      5u 0 inz(667)
     D CAPITAL_C                      5u 0 inz(722)
     D CAPITAL_D                      5u 0 inz(722)
     D CAPITAL_E                      5u 0 inz(667)
     D CAPITAL_F                      5u 0 inz(611)
     D CAPITAL_G                      5u 0 inz(778)
     D CAPITAL_H                      5u 0 inz(722)
     D CAPITAL_I                      5u 0 inz(278)
     D CAPITAL_J                      5u 0 inz(500)
     D CAPITAL_K                      5u 0 inz(667)
     D CAPITAL_L                      5u 0 inz(556)
     D CAPITAL_M                      5u 0 inz(833)
     D CAPITAL_N                      5u 0 inz(722)
     D CAPITAL_O                      5u 0 inz(778)
     D CAPITAL_P                      5u 0 inz(667)
     D CAPITAL_Q                      5u 0 inz(778)
     D CAPITAL_R                      5u 0 inz(722)
     D CAPITAL_S                      5u 0 inz(667)
     D CAPITAL_T                      5u 0 inz(611)
     D CAPITAL_U                      5u 0 inz(722)
     D CAPITAL_V                      5u 0 inz(667)
     D CAPITAL_W                      5u 0 inz(944)
     D CAPITAL_X                      5u 0 inz(667)
     D CAPITAL_Y                      5u 0 inz(667)
     D CAPITAL_Z                      5u 0 inz(611)
     D LEFT_BRACKET                   5u 0 inz(278)
     D BACKSLASH                      5u 0 inz(278)
     D RIGHT_BRACKET                  5u 0 inz(278)
     D CIRCUMFLEX_ACC                 5u 0 inz(469)
     D UNDERSCORE                     5u 0 inz(556)
     D GRAVE_ACCENT                   5u 0 inz(333)
     D SML_A                          5u 0 inz(556)
     D SML_B                          5u 0 inz(556)
     D SML_C                          5u 0 inz(500)
     D SML_D                          5u 0 inz(556)
     D SML_E                          5u 0 inz(556)
     D SML_F                          5u 0 inz(278)
     D SML_G                          5u 0 inz(556)
     D SML_H                          5u 0 inz(556)
     D SML_I                          5u 0 inz(222)
     D SML_J                          5u 0 inz(222)
     D SML_K                          5u 0 inz(500)
     D SML_L                          5u 0 inz(222)
     D SML_M                          5u 0 inz(833)
     D SML_N                          5u 0 inz(556)
     D SML_O                          5u 0 inz(556)
     D SML_P                          5u 0 inz(556)
     D SML_Q                          5u 0 inz(556)
     D SML_R                          5u 0 inz(333)
     D SML_S                          5u 0 inz(500)
     D SML_T                          5u 0 inz(278)
     D SML_U                          5u 0 inz(556)
     D SML_V                          5u 0 inz(500)
     D SML_W                          5u 0 inz(722)
     D SML_X                          5u 0 inz(500)
     D SML_Y                          5u 0 inz(500)
     D SML_Z                          5u 0 inz(500)
     D LEFT_BRACE                     5u 0 inz(334)
     D VERTICAL_LINE                  5u 0 inz(260)
     D RIGHT_BRACE                    5u 0 inz(334)
     D ASCIITILDE                     5u 0 inz(584)
     D DELETE                         5u 0 inz(350)
     D Euro                           5u 0 inz(556)
     D x81                            5u 0 inz(350)
     D x82                            5u 0 inz(223)
     D florin                         5u 0 inz(556)
     D quotedblbase                   5u 0 inz(333)
     D x85                            5u 0 inz(1000)
     D dagger                         5u 0 inz(556)
     D daggerdbl                      5u 0 inz(556)
     D circumflex                     5u 0 inz(333)
     D perthousand                    5u 0 inz(1000)
     D cap_Scaron                     5u 0 inz(666)
     D guilsinglleft                  5u 0 inz(333)
     D cap_OE                         5u 0 inz(1000)
     D x8d                            5u 0 inz(350)
     D cap_Zcaron                     5u 0 inz(612)
     D x8f                            5u 0 inz(350)
     D x90                            5u 0 inz(350)
     D quoteleft                      5u 0 inz(222)
     D quoteright                     5u 0 inz(222)
     D quotedblleft                   5u 0 inz(333)
     D quotedblright                  5u 0 inz(333)
     D bullet                         5u 0 inz(350)
     D underline                      5u 0 inz(556)
     D dbl_underline                  5u 0 inz(1000)
     D tilde                          5u 0 inz(333)
     D trademark                      5u 0 inz(1000)
     D sml_scaron                     5u 0 inz(500)
     D guilsinglright                 5u 0 inz(333)
     D sml_oe                         5u 0 inz(940)
     D x9d                            5u 0 inz(350)
     D sml_zcaron                     5u 0 inz(500)
     D Ydieresis                      5u 0 inz(667)
     D NO_BREAK_SPACE                 5u 0 inz(278)
     D INVERTED_EXCLA                 5u 0 inz(333)
     D CENT_SIGN                      5u 0 inz(556)
     D POUND_SIGN                     5u 0 inz(556)
     D CURRENCY_SIGN                  5u 0 inz(556)
     D YEN_SIGN                       5u 0 inz(556)
     D BROKEN_BAR                     5u 0 inz(260)
     D SECTION_SIGN                   5u 0 inz(556)
     D DIAERESIS                      5u 0 inz(333)
     D COPYRIGHT_SIGN                 5u 0 inz(737)
     D FEMININE_ORDIN                 5u 0 inz(370)
     D L_DBL_QUOTE                    5u 0 inz(556)
     D NOT_SIGN                       5u 0 inz(580)
     D SOFT_HYPHEN                    5u 0 inz(333)
     D REGISTERED                     5u 0 inz(737)
     D MACRON                         5u 0 inz(333)
     D DEGREE_SIGN                    5u 0 inz(400)
     D PLUS_MINUS                     5u 0 inz(584)
     D SUPER_TWO                      5u 0 inz(333)
     D SUPER_THREE                    5u 0 inz(333)
     D ACUTE_ACCENT                   5u 0 inz(333)
     D MICRO_SIGN                     5u 0 inz(578)
     D PARAGRAPH_SIGN                 5u 0 inz(537)
     D MIDDLE_DOT                     5u 0 inz(278)
     D CEDILLA                        5u 0 inz(333)
     D SUPER_ONE                      5u 0 inz(333)
     D MASCULINE_ORDI                 5u 0 inz(365)
     D R_DBL_QUOTE                    5u 0 inz(556)
     D ONE_QUARTER                    5u 0 inz(834)
     D ONE_HALF                       5u 0 inz(834)
     D THREE_QUARTERS                 5u 0 inz(834)
     D INVERTED_QUEST                 5u 0 inz(611)
     D CAP_A_GRAVE                    5u 0 inz(667)
     D CAP_A_ACUTE                    5u 0 inz(667)
     D CAP_A_CIRCUMFL                 5u 0 inz(667)
     D CAP_A_TILDE                    5u 0 inz(667)
     D CAP_A_DIAERESI                 5u 0 inz(667)
     D CAP_A_RING_ABO                 5u 0 inz(667)
     D CAP_AE                         5u 0 inz(1000)
     D CAP_C_CEDILLA                  5u 0 inz(722)
     D CAP_E_GRAVE                    5u 0 inz(667)
     D CAP_E_ACUTE                    5u 0 inz(667)
     D CAP_E_CIRCUMFL                 5u 0 inz(667)
     D CAP_E_DIAERESI                 5u 0 inz(667)
     D CAP_I_GRAVE                    5u 0 inz(278)
     D CAP_I_ACUTE                    5u 0 inz(278)
     D CAP_I_CIRCUMFL                 5u 0 inz(278)
     D CAP_I_DIAERESI                 5u 0 inz(278)
     D CAP_ETH                        5u 0 inz(722)
     D CAP_N_TILDE                    5u 0 inz(722)
     D CAP_O_GRAVE                    5u 0 inz(778)
     D CAP_O_ACUTE                    5u 0 inz(778)
     D CAP_O_CIRCUMFL                 5u 0 inz(778)
     D CAP_O_TILDE                    5u 0 inz(778)
     D CAP_O_DIAERESI                 5u 0 inz(778)
     D MULTIPLICATION                 5u 0 inz(584)
     D CAP_O_SLASH                    5u 0 inz(778)
     D CAP_U_GRAVE                    5u 0 inz(722)
     D CAP_U_ACUTE                    5u 0 inz(722)
     D CAP_U_CIRCUMFL                 5u 0 inz(722)
     D CAP_U_DIAERESI                 5u 0 inz(722)
     D CAP_Y_ACUTE                    5u 0 inz(667)
     D CAP_THORN                      5u 0 inz(667)
     D SML_SHARP_S                    5u 0 inz(612)
     D SML_A_GRAVE                    5u 0 inz(556)
     D SML_A_ACUTE                    5u 0 inz(556)
     D SML_A_CIRCUMFL                 5u 0 inz(556)
     D SML_A_TILDE                    5u 0 inz(556)
     D SML_A_DIAERESI                 5u 0 inz(556)
     D SML_A_RING_ABO                 5u 0 inz(556)
     D SML_AE                         5u 0 inz(889)
     D SML_C_CEDILLA                  5u 0 inz(500)
     D SML_E_GRAVE                    5u 0 inz(556)
     D SML_E_ACUTE                    5u 0 inz(556)
     D SML_E_CIRCUMFL                 5u 0 inz(556)
     D SML_E_DIAERESI                 5u 0 inz(556)
     D SML_I_GRAVE                    5u 0 inz(278)
     D SML_I_ACUTE                    5u 0 inz(278)
     D SML_I_CIRCUMFL                 5u 0 inz(278)
     D SML_I_DIAERESI                 5u 0 inz(278)
     D SML_ETH                        5u 0 inz(556)
     D SML_N_TILDE                    5u 0 inz(556)
     D SML_O_GRAVE                    5u 0 inz(556)
     D SML_O_ACUTE                    5u 0 inz(556)
     D SML_O_CIRCUMFL                 5u 0 inz(556)
     D SML_O_TILDE                    5u 0 inz(556)
     D SML_O_DIAERESI                 5u 0 inz(556)
     D DIVISION_SIGN                  5u 0 inz(584)
     D SML_O_SLASH                    5u 0 inz(611)
     D SML_U_GRAVE                    5u 0 inz(556)
     D SML_U_ACUTE                    5u 0 inz(556)
     D SML_U_CIRCUMFL                 5u 0 inz(556)
     D SML_U_DIAERESI                 5u 0 inz(556)
     D SML_Y_ACUTE                    5u 0 inz(500)
     D SML_THORN                      5u 0 inz(556)
     D SML_Y_DIAERESI                 5u 0 inz(500)
     d size                           5u 0 dim(224) overlay(HVO )

     d TIB             ds           448    qualified
    ? * Times-Bold
     D SPACE                          5u 0 inz(250)
     D EXCLAMATION                    5u 0 inz(333)
     D QUOTATION_MARK                 5u 0 inz(555)
     D NUMBER_SIGN                    5u 0 inz(500)
     D DOLLAR_SIGN                    5u 0 inz(500)
     D PERCENT_SIGN                   5u 0 inz(1000)
     D AMPERSAND                      5u 0 inz(833)
     D APOSTROPHE                     5u 0 inz(278)
     D L_PARENTHESIS                  5u 0 inz(333)
     D R_PARENTHESIS                  5u 0 inz(333)
     D ASTERISK                       5u 0 inz(500)
     D PLUS_SIGN                      5u 0 inz(570)
     D COMMA                          5u 0 inz(250)
     D HYPHEN_MINUS                   5u 0 inz(333)
     D PERIOD                         5u 0 inz(250)
     D SLASH                          5u 0 inz(278)
     D DIGIT_ZERO                     5u 0 inz(500)
     D DIGIT_ONE                      5u 0 inz(500)
     D DIGIT_TWO                      5u 0 inz(500)
     D DIGIT_THREE                    5u 0 inz(500)
     D DIGIT_FOUR                     5u 0 inz(500)
     D DIGIT_FIVE                     5u 0 inz(500)
     D DIGIT_SIX                      5u 0 inz(500)
     D DIGIT_SEVEN                    5u 0 inz(500)
     D DIGIT_EIGHT                    5u 0 inz(500)
     D DIGIT_NINE                     5u 0 inz(500)
     D COLON                          5u 0 inz(333)
     D SEMICOLON                      5u 0 inz(333)
     D LESS_THAN_SIGN                 5u 0 inz(570)
     D EQUALS_SIGN                    5u 0 inz(570)
     D GREATER_THAN                   5u 0 inz(570)
     D QUESTION_MARK                  5u 0 inz(500)
     D COMMERCIAL_AT                  5u 0 inz(930)
     D CAPITAL_A                      5u 0 inz(722)
     D CAPITAL_B                      5u 0 inz(667)
     D CAPITAL_C                      5u 0 inz(722)
     D CAPITAL_D                      5u 0 inz(722)
     D CAPITAL_E                      5u 0 inz(667)
     D CAPITAL_F                      5u 0 inz(611)
     D CAPITAL_G                      5u 0 inz(778)
     D CAPITAL_H                      5u 0 inz(778)
     D CAPITAL_I                      5u 0 inz(389)
     D CAPITAL_J                      5u 0 inz(500)
     D CAPITAL_K                      5u 0 inz(778)
     D CAPITAL_L                      5u 0 inz(667)
     D CAPITAL_M                      5u 0 inz(944)
     D CAPITAL_N                      5u 0 inz(722)
     D CAPITAL_O                      5u 0 inz(778)
     D CAPITAL_P                      5u 0 inz(611)
     D CAPITAL_Q                      5u 0 inz(778)
     D CAPITAL_R                      5u 0 inz(722)
     D CAPITAL_S                      5u 0 inz(556)
     D CAPITAL_T                      5u 0 inz(667)
     D CAPITAL_U                      5u 0 inz(722)
     D CAPITAL_V                      5u 0 inz(722)
     D CAPITAL_W                      5u 0 inz(1000)
     D CAPITAL_X                      5u 0 inz(722)
     D CAPITAL_Y                      5u 0 inz(722)
     D CAPITAL_Z                      5u 0 inz(667)
     D LEFT_BRACKET                   5u 0 inz(333)
     D BACKSLASH                      5u 0 inz(278)
     D RIGHT_BRACKET                  5u 0 inz(333)
     D CIRCUMFLEX_ACC                 5u 0 inz(581)
     D UNDERSCORE                     5u 0 inz(500)
     D GRAVE_ACCENT                   5u 0 inz(333)
     D SML_A                          5u 0 inz(500)
     D SML_B                          5u 0 inz(556)
     D SML_C                          5u 0 inz(444)
     D SML_D                          5u 0 inz(556)
     D SML_E                          5u 0 inz(444)
     D SML_F                          5u 0 inz(333)
     D SML_G                          5u 0 inz(500)
     D SML_H                          5u 0 inz(556)
     D SML_I                          5u 0 inz(278)
     D SML_J                          5u 0 inz(333)
     D SML_K                          5u 0 inz(556)
     D SML_L                          5u 0 inz(278)
     D SML_M                          5u 0 inz(833)
     D SML_N                          5u 0 inz(556)
     D SML_O                          5u 0 inz(500)
     D SML_P                          5u 0 inz(556)
     D SML_Q                          5u 0 inz(556)
     D SML_R                          5u 0 inz(444)
     D SML_S                          5u 0 inz(389)
     D SML_T                          5u 0 inz(333)
     D SML_U                          5u 0 inz(556)
     D SML_V                          5u 0 inz(500)
     D SML_W                          5u 0 inz(722)
     D SML_X                          5u 0 inz(500)
     D SML_Y                          5u 0 inz(500)
     D SML_Z                          5u 0 inz(444)
     D LEFT_BRACE                     5u 0 inz(394)
     D VERTICAL_LINE                  5u 0 inz(220)
     D RIGHT_BRACE                    5u 0 inz(394)
     D ASCIITILDE                     5u 0 inz(520)
     D DELETE                         5u 0 inz(350)
     D Euro                           5u 0 inz(500)
     D x81                            5u 0 inz(350)
     D x82                            5u 0 inz(333)
     D florin                         5u 0 inz(500)
     D quotedblbase                   5u 0 inz(500)
     D x85                            5u 0 inz(1000)
     D dagger                         5u 0 inz(500)
     D daggerdbl                      5u 0 inz(500)
     D circumflex                     5u 0 inz(333)
     D perthousand                    5u 0 inz(1000)
     D cap_Scaron                     5u 0 inz(556)
     D guilsinglleft                  5u 0 inz(333)
     D cap_OE                         5u 0 inz(1000)
     D x8d                            5u 0 inz(350)
     D cap_Zcaron                     5u 0 inz(666)
     D x8f                            5u 0 inz(350)
     D x90                            5u 0 inz(350)
     D quoteleft                      5u 0 inz(333)
     D quoteright                     5u 0 inz(333)
     D quotedblleft                   5u 0 inz(500)
     D quotedblright                  5u 0 inz(500)
     D bullet                         5u 0 inz(350)
     D underline                      5u 0 inz(500)
     D dbl_underline                  5u 0 inz(1000)
     D tilde                          5u 0 inz(333)
     D trademark                      5u 0 inz(1000)
     D sml_scaron                     5u 0 inz(388)
     D guilsinglright                 5u 0 inz(333)
     D sml_oe                         5u 0 inz(722)
     D x9d                            5u 0 inz(350)
     D sml_zcaron                     5u 0 inz(444)
     D Ydieresis                      5u 0 inz(722)
     D NO_BREAK_SPACE                 5u 0 inz(250)
     D INVERTED_EXCLA                 5u 0 inz(333)
     D CENT_SIGN                      5u 0 inz(500)
     D POUND_SIGN                     5u 0 inz(500)
     D CURRENCY_SIGN                  5u 0 inz(500)
     D YEN_SIGN                       5u 0 inz(500)
     D BROKEN_BAR                     5u 0 inz(220)
     D SECTION_SIGN                   5u 0 inz(500)
     D DIAERESIS                      5u 0 inz(333)
     D COPYRIGHT_SIGN                 5u 0 inz(747)
     D FEMININE_ORDIN                 5u 0 inz(300)
     D L_DBL_QUOTE                    5u 0 inz(500)
     D NOT_SIGN                       5u 0 inz(566)
     D SOFT_HYPHEN                    5u 0 inz(333)
     D REGISTERED                     5u 0 inz(747)
     D MACRON                         5u 0 inz(333)
     D DEGREE_SIGN                    5u 0 inz(400)
     D PLUS_MINUS                     5u 0 inz(570)
     D SUPER_TWO                      5u 0 inz(300)
     D SUPER_THREE                    5u 0 inz(300)
     D ACUTE_ACCENT                   5u 0 inz(333)
     D MICRO_SIGN                     5u 0 inz(600)
     D PARAGRAPH_SIGN                 5u 0 inz(540)
     D MIDDLE_DOT                     5u 0 inz(250)
     D CEDILLA                        5u 0 inz(330)
     D SUPER_ONE                      5u 0 inz(300)
     D MASCULINE_ORDI                 5u 0 inz(330)
     D R_DBL_QUOTE                    5u 0 inz(500)
     D ONE_QUARTER                    5u 0 inz(750)
     D ONE_HALF                       5u 0 inz(750)
     D THREE_QUARTERS                 5u 0 inz(750)
     D INVERTED_QUEST                 5u 0 inz(500)
     D CAP_A_GRAVE                    5u 0 inz(722)
     D CAP_A_ACUTE                    5u 0 inz(722)
     D CAP_A_CIRCUMFL                 5u 0 inz(722)
     D CAP_A_TILDE                    5u 0 inz(722)
     D CAP_A_DIAERESI                 5u 0 inz(722)
     D CAP_A_RING_ABO                 5u 0 inz(722)
     D CAP_AE                         5u 0 inz(1000)
     D CAP_C_CEDILLA                  5u 0 inz(722)
     D CAP_E_GRAVE                    5u 0 inz(667)
     D CAP_E_ACUTE                    5u 0 inz(667)
     D CAP_E_CIRCUMFL                 5u 0 inz(667)
     D CAP_E_DIAERESI                 5u 0 inz(667)
     D CAP_I_GRAVE                    5u 0 inz(389)
     D CAP_I_ACUTE                    5u 0 inz(389)
     D CAP_I_CIRCUMFL                 5u 0 inz(389)
     D CAP_I_DIAERESI                 5u 0 inz(389)
     D CAP_ETH                        5u 0 inz(722)
     D CAP_N_TILDE                    5u 0 inz(722)
     D CAP_O_GRAVE                    5u 0 inz(778)
     D CAP_O_ACUTE                    5u 0 inz(778)
     D CAP_O_CIRCUMFL                 5u 0 inz(778)
     D CAP_O_TILDE                    5u 0 inz(778)
     D CAP_O_DIAERESI                 5u 0 inz(778)
     D MULTIPLICATION                 5u 0 inz(570)
     D CAP_O_SLASH                    5u 0 inz(778)
     D CAP_U_GRAVE                    5u 0 inz(722)
     D CAP_U_ACUTE                    5u 0 inz(722)
     D CAP_U_CIRCUMFL                 5u 0 inz(722)
     D CAP_U_DIAERESI                 5u 0 inz(722)
     D CAP_Y_ACUTE                    5u 0 inz(722)
     D CAP_THORN                      5u 0 inz(611)
     D SML_SHARP_S                    5u 0 inz(555)
     D SML_A_GRAVE                    5u 0 inz(500)
     D SML_A_ACUTE                    5u 0 inz(500)
     D SML_A_CIRCUMFL                 5u 0 inz(500)
     D SML_A_TILDE                    5u 0 inz(500)
     D SML_A_DIAERESI                 5u 0 inz(500)
     D SML_A_RING_ABO                 5u 0 inz(500)
     D SML_AE                         5u 0 inz(722)
     D SML_C_CEDILLA                  5u 0 inz(444)
     D SML_E_GRAVE                    5u 0 inz(444)
     D SML_E_ACUTE                    5u 0 inz(444)
     D SML_E_CIRCUMFL                 5u 0 inz(444)
     D SML_E_DIAERESI                 5u 0 inz(444)
     D SML_I_GRAVE                    5u 0 inz(278)
     D SML_I_ACUTE                    5u 0 inz(278)
     D SML_I_CIRCUMFL                 5u 0 inz(278)
     D SML_I_DIAERESI                 5u 0 inz(278)
     D SML_ETH                        5u 0 inz(500)
     D SML_N_TILDE                    5u 0 inz(566)
     D SML_O_GRAVE                    5u 0 inz(500)
     D SML_O_ACUTE                    5u 0 inz(500)
     D SML_O_CIRCUMFL                 5u 0 inz(500)
     D SML_O_TILDE                    5u 0 inz(500)
     D SML_O_DIAERESI                 5u 0 inz(500)
     D DIVISION_SIGN                  5u 0 inz(570)
     D SML_O_SLASH                    5u 0 inz(500)
     D SML_U_GRAVE                    5u 0 inz(556)
     D SML_U_ACUTE                    5u 0 inz(556)
     D SML_U_CIRCUMFL                 5u 0 inz(556)
     D SML_U_DIAERESI                 5u 0 inz(556)
     D SML_Y_ACUTE                    5u 0 inz(500)
     D SML_THORN                      5u 0 inz(556)
     D SML_Y_DIAERESI                 5u 0 inz(500)
     d size                           5u 0 dim(224) overlay(TIB )

     d TIBI            ds           448    qualified
    ? * Times-BoldItalic
     D SPACE                          5u 0 inz(250)
     D EXCLAMATION                    5u 0 inz(389)
     D QUOTATION_MARK                 5u 0 inz(555)
     D NUMBER_SIGN                    5u 0 inz(500)
     D DOLLAR_SIGN                    5u 0 inz(500)
     D PERCENT_SIGN                   5u 0 inz(833)
     D AMPERSAND                      5u 0 inz(778)
     D APOSTROPHE                     5u 0 inz(278)
     D L_PARENTHESIS                  5u 0 inz(333)
     D R_PARENTHESIS                  5u 0 inz(333)
     D ASTERISK                       5u 0 inz(500)
     D PLUS_SIGN                      5u 0 inz(570)
     D COMMA                          5u 0 inz(250)
     D HYPHEN_MINUS                   5u 0 inz(333)
     D PERIOD                         5u 0 inz(250)
     D SLASH                          5u 0 inz(278)
     D DIGIT_ZERO                     5u 0 inz(500)
     D DIGIT_ONE                      5u 0 inz(500)
     D DIGIT_TWO                      5u 0 inz(500)
     D DIGIT_THREE                    5u 0 inz(500)
     D DIGIT_FOUR                     5u 0 inz(500)
     D DIGIT_FIVE                     5u 0 inz(500)
     D DIGIT_SIX                      5u 0 inz(500)
     D DIGIT_SEVEN                    5u 0 inz(500)
     D DIGIT_EIGHT                    5u 0 inz(500)
     D DIGIT_NINE                     5u 0 inz(500)
     D COLON                          5u 0 inz(333)
     D SEMICOLON                      5u 0 inz(333)
     D LESS_THAN_SIGN                 5u 0 inz(570)
     D EQUALS_SIGN                    5u 0 inz(570)
     D GREATER_THAN                   5u 0 inz(570)
     D QUESTION_MARK                  5u 0 inz(500)
     D COMMERCIAL_AT                  5u 0 inz(832)
     D CAPITAL_A                      5u 0 inz(667)
     D CAPITAL_B                      5u 0 inz(667)
     D CAPITAL_C                      5u 0 inz(667)
     D CAPITAL_D                      5u 0 inz(722)
     D CAPITAL_E                      5u 0 inz(667)
     D CAPITAL_F                      5u 0 inz(667)
     D CAPITAL_G                      5u 0 inz(722)
     D CAPITAL_H                      5u 0 inz(778)
     D CAPITAL_I                      5u 0 inz(389)
     D CAPITAL_J                      5u 0 inz(500)
     D CAPITAL_K                      5u 0 inz(667)
     D CAPITAL_L                      5u 0 inz(611)
     D CAPITAL_M                      5u 0 inz(889)
     D CAPITAL_N                      5u 0 inz(722)
     D CAPITAL_O                      5u 0 inz(722)
     D CAPITAL_P                      5u 0 inz(611)
     D CAPITAL_Q                      5u 0 inz(722)
     D CAPITAL_R                      5u 0 inz(667)
     D CAPITAL_S                      5u 0 inz(556)
     D CAPITAL_T                      5u 0 inz(611)
     D CAPITAL_U                      5u 0 inz(722)
     D CAPITAL_V                      5u 0 inz(667)
     D CAPITAL_W                      5u 0 inz(889)
     D CAPITAL_X                      5u 0 inz(667)
     D CAPITAL_Y                      5u 0 inz(611)
     D CAPITAL_Z                      5u 0 inz(611)
     D LEFT_BRACKET                   5u 0 inz(333)
     D BACKSLASH                      5u 0 inz(278)
     D RIGHT_BRACKET                  5u 0 inz(333)
     D CIRCUMFLEX_ACC                 5u 0 inz(570)
     D UNDERSCORE                     5u 0 inz(500)
     D GRAVE_ACCENT                   5u 0 inz(333)
     D SML_A                          5u 0 inz(500)
     D SML_B                          5u 0 inz(500)
     D SML_C                          5u 0 inz(444)
     D SML_D                          5u 0 inz(500)
     D SML_E                          5u 0 inz(444)
     D SML_F                          5u 0 inz(333)
     D SML_G                          5u 0 inz(500)
     D SML_H                          5u 0 inz(556)
     D SML_I                          5u 0 inz(278)
     D SML_J                          5u 0 inz(278)
     D SML_K                          5u 0 inz(500)
     D SML_L                          5u 0 inz(278)
     D SML_M                          5u 0 inz(778)
     D SML_N                          5u 0 inz(556)
     D SML_O                          5u 0 inz(500)
     D SML_P                          5u 0 inz(500)
     D SML_Q                          5u 0 inz(500)
     D SML_R                          5u 0 inz(389)
     D SML_S                          5u 0 inz(389)
     D SML_T                          5u 0 inz(278)
     D SML_U                          5u 0 inz(556)
     D SML_V                          5u 0 inz(444)
     D SML_W                          5u 0 inz(667)
     D SML_X                          5u 0 inz(500)
     D SML_Y                          5u 0 inz(444)
     D SML_Z                          5u 0 inz(389)
     D LEFT_BRACE                     5u 0 inz(348)
     D VERTICAL_LINE                  5u 0 inz(220)
     D RIGHT_BRACE                    5u 0 inz(348)
     D ASCIITILDE                     5u 0 inz(570)
     D DELETE                         5u 0 inz(350)
     D Euro                           5u 0 inz(500)
     D x81                            5u 0 inz(350)
     D x82                            5u 0 inz(333)
     D florin                         5u 0 inz(500)
     D quotedblbase                   5u 0 inz(500)
     D x85                            5u 0 inz(1000)
     D dagger                         5u 0 inz(500)
     D daggerdbl                      5u 0 inz(500)
     D circumflex                     5u 0 inz(333)
     D perthousand                    5u 0 inz(1000)
     D cap_Scaron                     5u 0 inz(556)
     D guilsinglleft                  5u 0 inz(333)
     D cap_OE                         5u 0 inz(944)
     D x8d                            5u 0 inz(350)
     D cap_Zcaron                     5u 0 inz(612)
     D x8f                            5u 0 inz(350)
     D x90                            5u 0 inz(350)
     D quoteleft                      5u 0 inz(333)
     D quoteright                     5u 0 inz(333)
     D quotedblleft                   5u 0 inz(500)
     D quotedblright                  5u 0 inz(500)
     D bullet                         5u 0 inz(350)
     D underline                      5u 0 inz(500)
     D dbl_underline                  5u 0 inz(1000)
     D tilde                          5u 0 inz(333)
     D trademark                      5u 0 inz(1000)
     D sml_scaron                     5u 0 inz(388)
     D guilsinglright                 5u 0 inz(333)
     D sml_oe                         5u 0 inz(711)
     D x9d                            5u 0 inz(350)
     D sml_zcaron                     5u 0 inz(388)
     D Ydieresis                      5u 0 inz(611)
     D NO_BREAK_SPACE                 5u 0 inz(250)
     D INVERTED_EXCLA                 5u 0 inz(389)
     D CENT_SIGN                      5u 0 inz(500)
     D POUND_SIGN                     5u 0 inz(500)
     D CURRENCY_SIGN                  5u 0 inz(500)
     D YEN_SIGN                       5u 0 inz(500)
     D BROKEN_BAR                     5u 0 inz(220)
     D SECTION_SIGN                   5u 0 inz(500)
     D DIAERESIS                      5u 0 inz(333)
     D COPYRIGHT_SIGN                 5u 0 inz(747)
     D FEMININE_ORDIN                 5u 0 inz(266)
     D L_DBL_QUOTE                    5u 0 inz(500)
     D NOT_SIGN                       5u 0 inz(611)
     D SOFT_HYPHEN                    5u 0 inz(333)
     D REGISTERED                     5u 0 inz(747)
     D MACRON                         5u 0 inz(333)
     D DEGREE_SIGN                    5u 0 inz(400)
     D PLUS_MINUS                     5u 0 inz(570)
     D SUPER_TWO                      5u 0 inz(300)
     D SUPER_THREE                    5u 0 inz(300)
     D ACUTE_ACCENT                   5u 0 inz(333)
     D MICRO_SIGN                     5u 0 inz(531)
     D PARAGRAPH_SIGN                 5u 0 inz(500)
     D MIDDLE_DOT                     5u 0 inz(250)
     D CEDILLA                        5u 0 inz(333)
     D SUPER_ONE                      5u 0 inz(300)
     D MASCULINE_ORDI                 5u 0 inz(300)
     D R_DBL_QUOTE                    5u 0 inz(500)
     D ONE_QUARTER                    5u 0 inz(750)
     D ONE_HALF                       5u 0 inz(750)
     D THREE_QUARTERS                 5u 0 inz(750)
     D INVERTED_QUEST                 5u 0 inz(500)
     D CAP_A_GRAVE                    5u 0 inz(667)
     D CAP_A_ACUTE                    5u 0 inz(667)
     D CAP_A_CIRCUMFL                 5u 0 inz(667)
     D CAP_A_TILDE                    5u 0 inz(667)
     D CAP_A_DIAERESI                 5u 0 inz(667)
     D CAP_A_RING_ABO                 5u 0 inz(667)
     D CAP_AE                         5u 0 inz(944)
     D CAP_C_CEDILLA                  5u 0 inz(667)
     D CAP_E_GRAVE                    5u 0 inz(667)
     D CAP_E_ACUTE                    5u 0 inz(667)
     D CAP_E_CIRCUMFL                 5u 0 inz(667)
     D CAP_E_DIAERESI                 5u 0 inz(667)
     D CAP_I_GRAVE                    5u 0 inz(388)
     D CAP_I_ACUTE                    5u 0 inz(388)
     D CAP_I_CIRCUMFL                 5u 0 inz(389)
     D CAP_I_DIAERESI                 5u 0 inz(388)
     D CAP_ETH                        5u 0 inz(722)
     D CAP_N_TILDE                    5u 0 inz(722)
     D CAP_O_GRAVE                    5u 0 inz(722)
     D CAP_O_ACUTE                    5u 0 inz(722)
     D CAP_O_CIRCUMFL                 5u 0 inz(722)
     D CAP_O_TILDE                    5u 0 inz(722)
     D CAP_O_DIAERESI                 5u 0 inz(722)
     D MULTIPLICATION                 5u 0 inz(570)
     D CAP_O_SLASH                    5u 0 inz(722)
     D CAP_U_GRAVE                    5u 0 inz(722)
     D CAP_U_ACUTE                    5u 0 inz(722)
     D CAP_U_CIRCUMFL                 5u 0 inz(722)
     D CAP_U_DIAERESI                 5u 0 inz(722)
     D CAP_Y_ACUTE                    5u 0 inz(611)
     D CAP_THORN                      5u 0 inz(611)
     D SML_SHARP_S                    5u 0 inz(500)
     D SML_A_GRAVE                    5u 0 inz(500)
     D SML_A_ACUTE                    5u 0 inz(500)
     D SML_A_CIRCUMFL                 5u 0 inz(500)
     D SML_A_TILDE                    5u 0 inz(500)
     D SML_A_DIAERESI                 5u 0 inz(500)
     D SML_A_RING_ABO                 5u 0 inz(500)
     D SML_AE                         5u 0 inz(722)
     D SML_C_CEDILLA                  5u 0 inz(444)
     D SML_E_GRAVE                    5u 0 inz(444)
     D SML_E_ACUTE                    5u 0 inz(444)
     D SML_E_CIRCUMFL                 5u 0 inz(444)
     D SML_E_DIAERESI                 5u 0 inz(444)
     D SML_I_GRAVE                    5u 0 inz(278)
     D SML_I_ACUTE                    5u 0 inz(278)
     D SML_I_CIRCUMFL                 5u 0 inz(278)
     D SML_I_DIAERESI                 5u 0 inz(278)
     D SML_ETH                        5u 0 inz(500)
     D SML_N_TILDE                    5u 0 inz(556)
     D SML_O_GRAVE                    5u 0 inz(500)
     D SML_O_ACUTE                    5u 0 inz(500)
     D SML_O_CIRCUMFL                 5u 0 inz(500)
     D SML_O_TILDE                    5u 0 inz(500)
     D SML_O_DIAERESI                 5u 0 inz(500)
     D DIVISION_SIGN                  5u 0 inz(570)
     D SML_O_SLASH                    5u 0 inz(500)
     D SML_U_GRAVE                    5u 0 inz(556)
     D SML_U_ACUTE                    5u 0 inz(556)
     D SML_U_CIRCUMFL                 5u 0 inz(556)
     D SML_U_DIAERESI                 5u 0 inz(556)
     D SML_Y_ACUTE                    5u 0 inz(444)
     D SML_THORN                      5u 0 inz(500)
     D SML_Y_DIAERESI                 5u 0 inz(444)
     d size                           5u 0 dim(224) overlay(TIBI)

     d TII             ds           448    qualified
    ? * Times-Italic
     D SPACE                          5u 0 inz(250)
     D EXCLAMATION                    5u 0 inz(333)
     D QUOTATION_MARK                 5u 0 inz(420)
     D NUMBER_SIGN                    5u 0 inz(500)
     D DOLLAR_SIGN                    5u 0 inz(500)
     D PERCENT_SIGN                   5u 0 inz(833)
     D AMPERSAND                      5u 0 inz(778)
     D APOSTROPHE                     5u 0 inz(217)
     D L_PARENTHESIS                  5u 0 inz(333)
     D R_PARENTHESIS                  5u 0 inz(333)
     D ASTERISK                       5u 0 inz(500)
     D PLUS_SIGN                      5u 0 inz(675)
     D COMMA                          5u 0 inz(250)
     D HYPHEN_MINUS                   5u 0 inz(333)
     D PERIOD                         5u 0 inz(250)
     D SLASH                          5u 0 inz(278)
     D DIGIT_ZERO                     5u 0 inz(500)
     D DIGIT_ONE                      5u 0 inz(500)
     D DIGIT_TWO                      5u 0 inz(500)
     D DIGIT_THREE                    5u 0 inz(500)
     D DIGIT_FOUR                     5u 0 inz(500)
     D DIGIT_FIVE                     5u 0 inz(500)
     D DIGIT_SIX                      5u 0 inz(500)
     D DIGIT_SEVEN                    5u 0 inz(500)
     D DIGIT_EIGHT                    5u 0 inz(500)
     D DIGIT_NINE                     5u 0 inz(500)
     D COLON                          5u 0 inz(333)
     D SEMICOLON                      5u 0 inz(333)
     D LESS_THAN_SIGN                 5u 0 inz(675)
     D EQUALS_SIGN                    5u 0 inz(675)
     D GREATER_THAN                   5u 0 inz(675)
     D QUESTION_MARK                  5u 0 inz(500)
     D COMMERCIAL_AT                  5u 0 inz(920)
     D CAPITAL_A                      5u 0 inz(611)
     D CAPITAL_B                      5u 0 inz(611)
     D CAPITAL_C                      5u 0 inz(667)
     D CAPITAL_D                      5u 0 inz(722)
     D CAPITAL_E                      5u 0 inz(611)
     D CAPITAL_F                      5u 0 inz(611)
     D CAPITAL_G                      5u 0 inz(722)
     D CAPITAL_H                      5u 0 inz(722)
     D CAPITAL_I                      5u 0 inz(333)
     D CAPITAL_J                      5u 0 inz(444)
     D CAPITAL_K                      5u 0 inz(667)
     D CAPITAL_L                      5u 0 inz(556)
     D CAPITAL_M                      5u 0 inz(833)
     D CAPITAL_N                      5u 0 inz(667)
     D CAPITAL_O                      5u 0 inz(722)
     D CAPITAL_P                      5u 0 inz(611)
     D CAPITAL_Q                      5u 0 inz(722)
     D CAPITAL_R                      5u 0 inz(611)
     D CAPITAL_S                      5u 0 inz(500)
     D CAPITAL_T                      5u 0 inz(556)
     D CAPITAL_U                      5u 0 inz(722)
     D CAPITAL_V                      5u 0 inz(611)
     D CAPITAL_W                      5u 0 inz(833)
     D CAPITAL_X                      5u 0 inz(611)
     D CAPITAL_Y                      5u 0 inz(556)
     D CAPITAL_Z                      5u 0 inz(556)
     D LEFT_BRACKET                   5u 0 inz(389)
     D BACKSLASH                      5u 0 inz(278)
     D RIGHT_BRACKET                  5u 0 inz(389)
     D CIRCUMFLEX_ACC                 5u 0 inz(422)
     D UNDERSCORE                     5u 0 inz(500)
     D GRAVE_ACCENT                   5u 0 inz(333)
     D SML_A                          5u 0 inz(500)
     D SML_B                          5u 0 inz(500)
     D SML_C                          5u 0 inz(444)
     D SML_D                          5u 0 inz(500)
     D SML_E                          5u 0 inz(444)
     D SML_F                          5u 0 inz(278)
     D SML_G                          5u 0 inz(500)
     D SML_H                          5u 0 inz(500)
     D SML_I                          5u 0 inz(278)
     D SML_J                          5u 0 inz(278)
     D SML_K                          5u 0 inz(444)
     D SML_L                          5u 0 inz(278)
     D SML_M                          5u 0 inz(722)
     D SML_N                          5u 0 inz(500)
     D SML_O                          5u 0 inz(500)
     D SML_P                          5u 0 inz(500)
     D SML_Q                          5u 0 inz(500)
     D SML_R                          5u 0 inz(389)
     D SML_S                          5u 0 inz(389)
     D SML_T                          5u 0 inz(278)
     D SML_U                          5u 0 inz(500)
     D SML_V                          5u 0 inz(444)
     D SML_W                          5u 0 inz(667)
     D SML_X                          5u 0 inz(444)
     D SML_Y                          5u 0 inz(444)
     D SML_Z                          5u 0 inz(389)
     D LEFT_BRACE                     5u 0 inz(400)
     D VERTICAL_LINE                  5u 0 inz(275)
     D RIGHT_BRACE                    5u 0 inz(400)
     D ASCIITILDE                     5u 0 inz(541)
     D DELETE                         5u 0 inz(350)
     D Euro                           5u 0 inz(500)
     D x81                            5u 0 inz(350)
     D x82                            5u 0 inz(333)
     D florin                         5u 0 inz(500)
     D quotedblbase                   5u 0 inz(556)
     D x85                            5u 0 inz(888)
     D dagger                         5u 0 inz(500)
     D daggerdbl                      5u 0 inz(500)
     D circumflex                     5u 0 inz(333)
     D perthousand                    5u 0 inz(1000)
     D cap_Scaron                     5u 0 inz(500)
     D guilsinglleft                  5u 0 inz(333)
     D cap_OE                         5u 0 inz(945)
     D x8d                            5u 0 inz(350)
     D cap_Zcaron                     5u 0 inz(556)
     D x8f                            5u 0 inz(350)
     D x90                            5u 0 inz(350)
     D quoteleft                      5u 0 inz(333)
     D quoteright                     5u 0 inz(333)
     D quotedblleft                   5u 0 inz(556)
     D quotedblright                  5u 0 inz(556)
     D bullet                         5u 0 inz(350)
     D underline                      5u 0 inz(500)
     D dbl_underline                  5u 0 inz(888)
     D tilde                          5u 0 inz(333)
     D trademark                      5u 0 inz(980)
     D sml_scaron                     5u 0 inz(388)
     D guilsinglright                 5u 0 inz(333)
     D sml_oe                         5u 0 inz(666)
     D x9d                            5u 0 inz(350)
     D sml_zcaron                     5u 0 inz(388)
     D Ydieresis                      5u 0 inz(556)
     D NO_BREAK_SPACE                 5u 0 inz(250)
     D INVERTED_EXCLA                 5u 0 inz(389)
     D CENT_SIGN                      5u 0 inz(500)
     D POUND_SIGN                     5u 0 inz(500)
     D CURRENCY_SIGN                  5u 0 inz(500)
     D YEN_SIGN                       5u 0 inz(500)
     D BROKEN_BAR                     5u 0 inz(275)
     D SECTION_SIGN                   5u 0 inz(500)
     D DIAERESIS                      5u 0 inz(333)
     D COPYRIGHT_SIGN                 5u 0 inz(760)
     D FEMININE_ORDIN                 5u 0 inz(276)
     D L_DBL_QUOTE                    5u 0 inz(500)
     D NOT_SIGN                       5u 0 inz(633)
     D SOFT_HYPHEN                    5u 0 inz(333)
     D REGISTERED                     5u 0 inz(760)
     D MACRON                         5u 0 inz(333)
     D DEGREE_SIGN                    5u 0 inz(400)
     D PLUS_MINUS                     5u 0 inz(675)
     D SUPER_TWO                      5u 0 inz(300)
     D SUPER_THREE                    5u 0 inz(300)
     D ACUTE_ACCENT                   5u 0 inz(333)
     D MICRO_SIGN                     5u 0 inz(511)
     D PARAGRAPH_SIGN                 5u 0 inz(523)
     D MIDDLE_DOT                     5u 0 inz(250)
     D CEDILLA                        5u 0 inz(333)
     D SUPER_ONE                      5u 0 inz(300)
     D MASCULINE_ORDI                 5u 0 inz(310)
     D R_DBL_QUOTE                    5u 0 inz(500)
     D ONE_QUARTER                    5u 0 inz(750)
     D ONE_HALF                       5u 0 inz(750)
     D THREE_QUARTERS                 5u 0 inz(750)
     D INVERTED_QUEST                 5u 0 inz(500)
     D CAP_A_GRAVE                    5u 0 inz(611)
     D CAP_A_ACUTE                    5u 0 inz(611)
     D CAP_A_CIRCUMFL                 5u 0 inz(611)
     D CAP_A_TILDE                    5u 0 inz(611)
     D CAP_A_DIAERESI                 5u 0 inz(611)
     D CAP_A_RING_ABO                 5u 0 inz(611)
     D CAP_AE                         5u 0 inz(887)
     D CAP_C_CEDILLA                  5u 0 inz(667)
     D CAP_E_GRAVE                    5u 0 inz(611)
     D CAP_E_ACUTE                    5u 0 inz(611)
     D CAP_E_CIRCUMFL                 5u 0 inz(611)
     D CAP_E_DIAERESI                 5u 0 inz(611)
     D CAP_I_GRAVE                    5u 0 inz(333)
     D CAP_I_ACUTE                    5u 0 inz(333)
     D CAP_I_CIRCUMFL                 5u 0 inz(333)
     D CAP_I_DIAERESI                 5u 0 inz(333)
     D CAP_ETH                        5u 0 inz(722)
     D CAP_N_TILDE                    5u 0 inz(667)
     D CAP_O_GRAVE                    5u 0 inz(722)
     D CAP_O_ACUTE                    5u 0 inz(722)
     D CAP_O_CIRCUMFL                 5u 0 inz(722)
     D CAP_O_TILDE                    5u 0 inz(722)
     D CAP_O_DIAERESI                 5u 0 inz(722)
     D MULTIPLICATION                 5u 0 inz(675)
     D CAP_O_SLASH                    5u 0 inz(722)
     D CAP_U_GRAVE                    5u 0 inz(722)
     D CAP_U_ACUTE                    5u 0 inz(722)
     D CAP_U_CIRCUMFL                 5u 0 inz(722)
     D CAP_U_DIAERESI                 5u 0 inz(722)
     D CAP_Y_ACUTE                    5u 0 inz(556)
     D CAP_THORN                      5u 0 inz(611)
     D SML_SHARP_S                    5u 0 inz(500)
     D SML_A_GRAVE                    5u 0 inz(500)
     D SML_A_ACUTE                    5u 0 inz(500)
     D SML_A_CIRCUMFL                 5u 0 inz(500)
     D SML_A_TILDE                    5u 0 inz(500)
     D SML_A_DIAERESI                 5u 0 inz(500)
     D SML_A_RING_ABO                 5u 0 inz(500)
     D SML_AE                         5u 0 inz(667)
     D SML_C_CEDILLA                  5u 0 inz(444)
     D SML_E_GRAVE                    5u 0 inz(444)
     D SML_E_ACUTE                    5u 0 inz(444)
     D SML_E_CIRCUMFL                 5u 0 inz(444)
     D SML_E_DIAERESI                 5u 0 inz(444)
     D SML_I_GRAVE                    5u 0 inz(278)
     D SML_I_ACUTE                    5u 0 inz(278)
     D SML_I_CIRCUMFL                 5u 0 inz(278)
     D SML_I_DIAERESI                 5u 0 inz(278)
     D SML_ETH                        5u 0 inz(500)
     D SML_N_TILDE                    5u 0 inz(500)
     D SML_O_GRAVE                    5u 0 inz(500)
     D SML_O_ACUTE                    5u 0 inz(500)
     D SML_O_CIRCUMFL                 5u 0 inz(500)
     D SML_O_TILDE                    5u 0 inz(500)
     D SML_O_DIAERESI                 5u 0 inz(500)
     D DIVISION_SIGN                  5u 0 inz(675)
     D SML_O_SLASH                    5u 0 inz(500)
     D SML_U_GRAVE                    5u 0 inz(500)
     D SML_U_ACUTE                    5u 0 inz(500)
     D SML_U_CIRCUMFL                 5u 0 inz(500)
     D SML_U_DIAERESI                 5u 0 inz(500)
     D SML_Y_ACUTE                    5u 0 inz(444)
     D SML_THORN                      5u 0 inz(500)
     D SML_Y_DIAERESI                 5u 0 inz(444)
     d size                           5u 0 dim(224) overlay(TII )

     d TIR             ds           448    qualified
    ? * Times-Roman
     D SPACE                          5u 0 inz(250)
     D EXCLAMATION                    5u 0 inz(333)
     D QUOTATION_MARK                 5u 0 inz(408)
     D NUMBER_SIGN                    5u 0 inz(500)
     D DOLLAR_SIGN                    5u 0 inz(500)
     D PERCENT_SIGN                   5u 0 inz(833)
     D AMPERSAND                      5u 0 inz(778)
     D APOSTROPHE                     5u 0 inz(178)
     D L_PARENTHESIS                  5u 0 inz(333)
     D R_PARENTHESIS                  5u 0 inz(333)
     D ASTERISK                       5u 0 inz(500)
     D PLUS_SIGN                      5u 0 inz(564)
     D COMMA                          5u 0 inz(250)
     D HYPHEN_MINUS                   5u 0 inz(333)
     D PERIOD                         5u 0 inz(250)
     D SLASH                          5u 0 inz(278)
     D DIGIT_ZERO                     5u 0 inz(500)
     D DIGIT_ONE                      5u 0 inz(500)
     D DIGIT_TWO                      5u 0 inz(500)
     D DIGIT_THREE                    5u 0 inz(500)
     D DIGIT_FOUR                     5u 0 inz(500)
     D DIGIT_FIVE                     5u 0 inz(500)
     D DIGIT_SIX                      5u 0 inz(500)
     D DIGIT_SEVEN                    5u 0 inz(500)
     D DIGIT_EIGHT                    5u 0 inz(500)
     D DIGIT_NINE                     5u 0 inz(500)
     D COLON                          5u 0 inz(278)
     D SEMICOLON                      5u 0 inz(278)
     D LESS_THAN_SIGN                 5u 0 inz(564)
     D EQUALS_SIGN                    5u 0 inz(564)
     D GREATER_THAN                   5u 0 inz(564)
     D QUESTION_MARK                  5u 0 inz(444)
     D COMMERCIAL_AT                  5u 0 inz(921)
     D CAPITAL_A                      5u 0 inz(722)
     D CAPITAL_B                      5u 0 inz(667)
     D CAPITAL_C                      5u 0 inz(670)
     D CAPITAL_D                      5u 0 inz(722)
     D CAPITAL_E                      5u 0 inz(612)
     D CAPITAL_F                      5u 0 inz(556)
     D CAPITAL_G                      5u 0 inz(722)
     D CAPITAL_H                      5u 0 inz(722)
     D CAPITAL_I                      5u 0 inz(333)
     D CAPITAL_J                      5u 0 inz(390)
     D CAPITAL_K                      5u 0 inz(722)
     D CAPITAL_L                      5u 0 inz(611)
     D CAPITAL_M                      5u 0 inz(890)
     D CAPITAL_N                      5u 0 inz(722)
     D CAPITAL_O                      5u 0 inz(722)
     D CAPITAL_P                      5u 0 inz(556)
     D CAPITAL_Q                      5u 0 inz(722)
     D CAPITAL_R                      5u 0 inz(667)
     D CAPITAL_S                      5u 0 inz(555)
     D CAPITAL_T                      5u 0 inz(612)
     D CAPITAL_U                      5u 0 inz(722)
     D CAPITAL_V                      5u 0 inz(722)
     D CAPITAL_W                      5u 0 inz(944)
     D CAPITAL_X                      5u 0 inz(722)
     D CAPITAL_Y                      5u 0 inz(722)
     D CAPITAL_Z                      5u 0 inz(611)
     D LEFT_BRACKET                   5u 0 inz(333)
     D BACKSLASH                      5u 0 inz(278)
     D RIGHT_BRACKET                  5u 0 inz(333)
     D CIRCUMFLEX_ACC                 5u 0 inz(469)
     D UNDERSCORE                     5u 0 inz(500)
     D GRAVE_ACCENT                   5u 0 inz(333)
     D SML_A                          5u 0 inz(444)
     D SML_B                          5u 0 inz(500)
     D SML_C                          5u 0 inz(444)
     D SML_D                          5u 0 inz(500)
     D SML_E                          5u 0 inz(444)
     D SML_F                          5u 0 inz(333)
     D SML_G                          5u 0 inz(500)
     D SML_H                          5u 0 inz(500)
     D SML_I                          5u 0 inz(278)
     D SML_J                          5u 0 inz(278)
     D SML_K                          5u 0 inz(500)
     D SML_L                          5u 0 inz(278)
     D SML_M                          5u 0 inz(778)
     D SML_N                          5u 0 inz(500)
     D SML_O                          5u 0 inz(500)
     D SML_P                          5u 0 inz(500)
     D SML_Q                          5u 0 inz(500)
     D SML_R                          5u 0 inz(333)
     D SML_S                          5u 0 inz(389)
     D SML_T                          5u 0 inz(278)
     D SML_U                          5u 0 inz(500)
     D SML_V                          5u 0 inz(500)
     D SML_W                          5u 0 inz(722)
     D SML_X                          5u 0 inz(500)
     D SML_Y                          5u 0 inz(500)
     D SML_Z                          5u 0 inz(444)
     D LEFT_BRACE                     5u 0 inz(480)
     D VERTICAL_LINE                  5u 0 inz(200)
     D RIGHT_BRACE                    5u 0 inz(480)
     D ASCIITILDE                     5u 0 inz(541)
     D DELETE                         5u 0 inz(350)
     D Euro                           5u 0 inz(500)
     D x81                            5u 0 inz(350)
     D x82                            5u 0 inz(333)
     D florin                         5u 0 inz(500)
     D quotedblbase                   5u 0 inz(444)
     D x85                            5u 0 inz(1000)
     D dagger                         5u 0 inz(500)
     D daggerdbl                      5u 0 inz(500)
     D circumflex                     5u 0 inz(333)
     D perthousand                    5u 0 inz(1000)
     D cap_Scaron                     5u 0 inz(556)
     D guilsinglleft                  5u 0 inz(333)
     D cap_OE                         5u 0 inz(888)
     D x8d                            5u 0 inz(350)
     D cap_Zcaron                     5u 0 inz(612)
     D x8f                            5u 0 inz(350)
     D x90                            5u 0 inz(350)
     D quoteleft                      5u 0 inz(333)
     D quoteright                     5u 0 inz(333)
     D quotedblleft                   5u 0 inz(444)
     D quotedblright                  5u 0 inz(444)
     D bullet                         5u 0 inz(350)
     D underline                      5u 0 inz(500)
     D dbl_underline                  5u 0 inz(1000)
     D tilde                          5u 0 inz(333)
     D trademark                      5u 0 inz(980)
     D sml_scaron                     5u 0 inz(390)
     D guilsinglright                 5u 0 inz(333)
     D sml_oe                         5u 0 inz(722)
     D x9d                            5u 0 inz(350)
     D sml_zcaron                     5u 0 inz(444)
     D Ydieresis                      5u 0 inz(722)
     D NO_BREAK_SPACE                 5u 0 inz(250)
     D INVERTED_EXCLA                 5u 0 inz(333)
     D CENT_SIGN                      5u 0 inz(500)
     D POUND_SIGN                     5u 0 inz(500)
     D CURRENCY_SIGN                  5u 0 inz(500)
     D YEN_SIGN                       5u 0 inz(500)
     D BROKEN_BAR                     5u 0 inz(200)
     D SECTION_SIGN                   5u 0 inz(500)
     D DIAERESIS                      5u 0 inz(333)
     D COPYRIGHT_SIGN                 5u 0 inz(760)
     D FEMININE_ORDIN                 5u 0 inz(276)
     D L_DBL_QUOTE                    5u 0 inz(500)
     D NOT_SIGN                       5u 0 inz(566)
     D SOFT_HYPHEN                    5u 0 inz(333)
     D REGISTERED                     5u 0 inz(760)
     D MACRON                         5u 0 inz(333)
     D DEGREE_SIGN                    5u 0 inz(400)
     D PLUS_MINUS                     5u 0 inz(564)
     D SUPER_TWO                      5u 0 inz(300)
     D SUPER_THREE                    5u 0 inz(300)
     D ACUTE_ACCENT                   5u 0 inz(333)
     D MICRO_SIGN                     5u 0 inz(511)
     D PARAGRAPH_SIGN                 5u 0 inz(453)
     D MIDDLE_DOT                     5u 0 inz(250)
     D CEDILLA                        5u 0 inz(333)
     D SUPER_ONE                      5u 0 inz(300)
     D MASCULINE_ORDI                 5u 0 inz(310)
     D R_DBL_QUOTE                    5u 0 inz(500)
     D ONE_QUARTER                    5u 0 inz(750)
     D ONE_HALF                       5u 0 inz(750)
     D THREE_QUARTERS                 5u 0 inz(750)
     D INVERTED_QUEST                 5u 0 inz(444)
     D CAP_A_GRAVE                    5u 0 inz(722)
     D CAP_A_ACUTE                    5u 0 inz(722)
     D CAP_A_CIRCUMFL                 5u 0 inz(722)
     D CAP_A_TILDE                    5u 0 inz(722)
     D CAP_A_DIAERESI                 5u 0 inz(722)
     D CAP_A_RING_ABO                 5u 0 inz(722)
     D CAP_AE                         5u 0 inz(888)
     D CAP_C_CEDILLA                  5u 0 inz(667)
     D CAP_E_GRAVE                    5u 0 inz(611)
     D CAP_E_ACUTE                    5u 0 inz(611)
     D CAP_E_CIRCUMFL                 5u 0 inz(611)
     D CAP_E_DIAERESI                 5u 0 inz(611)
     D CAP_I_GRAVE                    5u 0 inz(333)
     D CAP_I_ACUTE                    5u 0 inz(333)
     D CAP_I_CIRCUMFL                 5u 0 inz(333)
     D CAP_I_DIAERESI                 5u 0 inz(333)
     D CAP_ETH                        5u 0 inz(722)
     D CAP_N_TILDE                    5u 0 inz(722)
     D CAP_O_GRAVE                    5u 0 inz(722)
     D CAP_O_ACUTE                    5u 0 inz(722)
     D CAP_O_CIRCUMFL                 5u 0 inz(722)
     D CAP_O_TILDE                    5u 0 inz(722)
     D CAP_O_DIAERESI                 5u 0 inz(722)
     D MULTIPLICATION                 5u 0 inz(564)
     D CAP_O_SLASH                    5u 0 inz(722)
     D CAP_U_GRAVE                    5u 0 inz(722)
     D CAP_U_ACUTE                    5u 0 inz(722)
     D CAP_U_CIRCUMFL                 5u 0 inz(722)
     D CAP_U_DIAERESI                 5u 0 inz(722)
     D CAP_Y_ACUTE                    5u 0 inz(722)
     D CAP_THORN                      5u 0 inz(556)
     D SML_SHARP_S                    5u 0 inz(500)
     D SML_A_GRAVE                    5u 0 inz(444)
     D SML_A_ACUTE                    5u 0 inz(444)
     D SML_A_CIRCUMFL                 5u 0 inz(444)
     D SML_A_TILDE                    5u 0 inz(444)
     D SML_A_DIAERESI                 5u 0 inz(444)
     D SML_A_RING_ABO                 5u 0 inz(444)
     D SML_AE                         5u 0 inz(667)
     D SML_C_CEDILLA                  5u 0 inz(444)
     D SML_E_GRAVE                    5u 0 inz(444)
     D SML_E_ACUTE                    5u 0 inz(444)
     D SML_E_CIRCUMFL                 5u 0 inz(444)
     D SML_E_DIAERESI                 5u 0 inz(444)
     D SML_I_GRAVE                    5u 0 inz(278)
     D SML_I_ACUTE                    5u 0 inz(278)
     D SML_I_CIRCUMFL                 5u 0 inz(278)
     D SML_I_DIAERESI                 5u 0 inz(278)
     D SML_ETH                        5u 0 inz(500)
     D SML_N_TILDE                    5u 0 inz(500)
     D SML_O_GRAVE                    5u 0 inz(500)
     D SML_O_ACUTE                    5u 0 inz(500)
     D SML_O_CIRCUMFL                 5u 0 inz(500)
     D SML_O_TILDE                    5u 0 inz(500)
     D SML_O_DIAERESI                 5u 0 inz(500)
     D DIVISION_SIGN                  5u 0 inz(564)
     D SML_O_SLASH                    5u 0 inz(500)
     D SML_U_GRAVE                    5u 0 inz(500)
     D SML_U_ACUTE                    5u 0 inz(500)
     D SML_U_CIRCUMFL                 5u 0 inz(500)
     D SML_U_DIAERESI                 5u 0 inz(500)
     D SML_Y_ACUTE                    5u 0 inz(500)
     D SML_THORN                      5u 0 inz(500)
     D SML_Y_DIAERESI                 5u 0 inz(500)
     d size                           5u 0 dim(224) overlay(TIR )

     d ZAPF            ds           448    qualified
    ? * Times-Roman
     D SPACE                          5u 0 inz(278)
     D EXCLAMATION                    5u 0 inz(974)
     D QUOTATION_MARK                 5u 0 inz(961)
     D NUMBER_SIGN                    5u 0 inz(974)
     D DOLLAR_SIGN                    5u 0 inz(980)
     D PERCENT_SIGN                   5u 0 inz(719)
     D AMPERSAND                      5u 0 inz(789)
     D APOSTROPHE                     5u 0 inz(278)
     D L_PARENTHESIS                  5u 0 inz(791)
     D R_PARENTHESIS                  5u 0 inz(690)
     D ASTERISK                       5u 0 inz(960)
     D PLUS_SIGN                      5u 0 inz(939)
     D COMMA                          5u 0 inz(549)
     D HYPHEN_MINUS                   5u 0 inz(855)
     D PERIOD                         5u 0 inz(911)
     D SLASH                          5u 0 inz(933)
     D DIGIT_ZERO                     5u 0 inz(911)
     D DIGIT_ONE                      5u 0 inz(945)
     D DIGIT_TWO                      5u 0 inz(974)
     D DIGIT_THREE                    5u 0 inz(755)
     D DIGIT_FOUR                     5u 0 inz(846)
     D DIGIT_FIVE                     5u 0 inz(762)
     D DIGIT_SIX                      5u 0 inz(761)
     D DIGIT_SEVEN                    5u 0 inz(571)
     D DIGIT_EIGHT                    5u 0 inz(677)
     D DIGIT_NINE                     5u 0 inz(763)
     D COLON                          5u 0 inz(760)
     D SEMICOLON                      5u 0 inz(759)
     D LESS_THAN_SIGN                 5u 0 inz(754)
     D EQUALS_SIGN                    5u 0 inz(494)
     D GREATER_THAN                   5u 0 inz(552)
     D QUESTION_MARK                  5u 0 inz(537)
     D COMMERCIAL_AT                  5u 0 inz(577)
     D CAPITAL_A                      5u 0 inz(692)
     D CAPITAL_B                      5u 0 inz(786)
     D CAPITAL_C                      5u 0 inz(788)
     D CAPITAL_D                      5u 0 inz(788)
     D CAPITAL_E                      5u 0 inz(790)
     D CAPITAL_F                      5u 0 inz(793)
     D CAPITAL_G                      5u 0 inz(794)
     D CAPITAL_H                      5u 0 inz(816)
     D CAPITAL_I                      5u 0 inz(823)
     D CAPITAL_J                      5u 0 inz(789)
     D CAPITAL_K                      5u 0 inz(841)
     D CAPITAL_L                      5u 0 inz(823)
     D CAPITAL_M                      5u 0 inz(833)
     D CAPITAL_N                      5u 0 inz(816)
     D CAPITAL_O                      5u 0 inz(831)
     D CAPITAL_P                      5u 0 inz(923)
     D CAPITAL_Q                      5u 0 inz(744)
     D CAPITAL_R                      5u 0 inz(723)
     D CAPITAL_S                      5u 0 inz(749)
     D CAPITAL_T                      5u 0 inz(790)
     D CAPITAL_U                      5u 0 inz(792)
     D CAPITAL_V                      5u 0 inz(695)
     D CAPITAL_W                      5u 0 inz(776)
     D CAPITAL_X                      5u 0 inz(768)
     D CAPITAL_Y                      5u 0 inz(792)
     D CAPITAL_Z                      5u 0 inz(759)
     D LEFT_BRACKET                   5u 0 inz(707)
     D BACKSLASH                      5u 0 inz(708)
     D RIGHT_BRACKET                  5u 0 inz(682)
     D CIRCUMFLEX_ACC                 5u 0 inz(701)
     D UNDERSCORE                     5u 0 inz(826)
     D GRAVE_ACCENT                   5u 0 inz(278)
     D SML_A                          5u 0 inz(789)
     D SML_B                          5u 0 inz(789)
     D SML_C                          5u 0 inz(707)
     D SML_D                          5u 0 inz(687)
     D SML_E                          5u 0 inz(696)
     D SML_F                          5u 0 inz(689)
     D SML_G                          5u 0 inz(786)
     D SML_H                          5u 0 inz(787)
     D SML_I                          5u 0 inz(713)
     D SML_J                          5u 0 inz(791)
     D SML_K                          5u 0 inz(785)
     D SML_L                          5u 0 inz(791)
     D SML_M                          5u 0 inz(873)
     D SML_N                          5u 0 inz(761)
     D SML_O                          5u 0 inz(762)
     D SML_P                          5u 0 inz(762)
     D SML_Q                          5u 0 inz(759)
     D SML_R                          5u 0 inz(759)
     D SML_S                          5u 0 inz(892)
     D SML_T                          5u 0 inz(892)
     D SML_U                          5u 0 inz(788)
     D SML_V                          5u 0 inz(784)
     D SML_W                          5u 0 inz(438)
     D SML_X                          5u 0 inz(138)
     D SML_Y                          5u 0 inz(277)
     D SML_Z                          5u 0 inz(415)
     D LEFT_BRACE                     5u 0 inz(392)
     D VERTICAL_LINE                  5u 0 inz(392)
     D RIGHT_BRACE                    5u 0 inz(668)
     D ASCIITILDE                     5u 0 inz(668)
     D DELETE                         5u 0 inz(280)
     D Euro                           5u 0 inz(280)
     D x81                            5u 0 inz(280)
     D x82                            5u 0 inz(280)
     D florin                         5u 0 inz(280)
     D quotedblbase                   5u 0 inz(280)
     D x85                            5u 0 inz(280)
     D dagger                         5u 0 inz(280)
     D daggerdbl                      5u 0 inz(280)
     D circumflex                     5u 0 inz(280)
     D perthousand                    5u 0 inz(280)
     D cap_Scaron                     5u 0 inz(280)
     D guilsinglleft                  5u 0 inz(280)
     D cap_OE                         5u 0 inz(280)
     D x8d                            5u 0 inz(280)
     D cap_Zcaron                     5u 0 inz(280)
     D x8f                            5u 0 inz(280)
     D x90                            5u 0 inz(280)
     D quoteleft                      5u 0 inz(280)
     D quoteright                     5u 0 inz(280)
     D quotedblleft                   5u 0 inz(280)
     D quotedblright                  5u 0 inz(280)
     D bullet                         5u 0 inz(280)
     D underline                      5u 0 inz(280)
     D dbl_underline                  5u 0 inz(280)
     D tilde                          5u 0 inz(280)
     D trademark                      5u 0 inz(280)
     D sml_scaron                     5u 0 inz(280)
     D guilsinglright                 5u 0 inz(280)
     D sml_oe                         5u 0 inz(280)
     D x9d                            5u 0 inz(280)
     D sml_zcaron                     5u 0 inz(280)
     D Ydieresis                      5u 0 inz(280)
     D NO_BREAK_SPACE                 5u 0 inz(280)
     D INVERTED_EXCLA                 5u 0 inz(280)
     D CENT_SIGN                      5u 0 inz(280)
     D POUND_SIGN                     5u 0 inz(280)
     D CURRENCY_SIGN                  5u 0 inz(280)
     D YEN_SIGN                       5u 0 inz(280)
     D BROKEN_BAR                     5u 0 inz(280)
     D SECTION_SIGN                   5u 0 inz(280)
     D DIAERESIS                      5u 0 inz(280)
     D COPYRIGHT_SIGN                 5u 0 inz(280)
     D FEMININE_ORDIN                 5u 0 inz(280)
     D L_DBL_QUOTE                    5u 0 inz(280)
     D NOT_SIGN                       5u 0 inz(280)
     D SOFT_HYPHEN                    5u 0 inz(280)
     D REGISTERED                     5u 0 inz(280)
     D MACRON                         5u 0 inz(280)
     D DEGREE_SIGN                    5u 0 inz(280)
     D PLUS_MINUS                     5u 0 inz(280)
     D SUPER_TWO                      5u 0 inz(280)
     D SUPER_THREE                    5u 0 inz(280)
     D ACUTE_ACCENT                   5u 0 inz(280)
     D MICRO_SIGN                     5u 0 inz(280)
     D PARAGRAPH_SIGN                 5u 0 inz(280)
     D MIDDLE_DOT                     5u 0 inz(280)
     D CEDILLA                        5u 0 inz(280)
     D SUPER_ONE                      5u 0 inz(280)
     D MASCULINE_ORDI                 5u 0 inz(280)
     D R_DBL_QUOTE                    5u 0 inz(280)
     D ONE_QUARTER                    5u 0 inz(280)
     D ONE_HALF                       5u 0 inz(280)
     D THREE_QUARTERS                 5u 0 inz(280)
     D INVERTED_QUEST                 5u 0 inz(280)
     D CAP_A_GRAVE                    5u 0 inz(280)
     D CAP_A_ACUTE                    5u 0 inz(280)
     D CAP_A_CIRCUMFL                 5u 0 inz(280)
     D CAP_A_TILDE                    5u 0 inz(280)
     D CAP_A_DIAERESI                 5u 0 inz(280)
     D CAP_A_RING_ABO                 5u 0 inz(280)
     D CAP_AE                         5u 0 inz(280)
     D CAP_C_CEDILLA                  5u 0 inz(280)
     D CAP_E_GRAVE                    5u 0 inz(280)
     D CAP_E_ACUTE                    5u 0 inz(280)
     D CAP_E_CIRCUMFL                 5u 0 inz(280)
     D CAP_E_DIAERESI                 5u 0 inz(280)
     D CAP_I_GRAVE                    5u 0 inz(280)
     D CAP_I_ACUTE                    5u 0 inz(280)
     D CAP_I_CIRCUMFL                 5u 0 inz(280)
     D CAP_I_DIAERESI                 5u 0 inz(280)
     D CAP_ETH                        5u 0 inz(280)
     D CAP_N_TILDE                    5u 0 inz(280)
     D CAP_O_GRAVE                    5u 0 inz(280)
     D CAP_O_ACUTE                    5u 0 inz(280)
     D CAP_O_CIRCUMFL                 5u 0 inz(280)
     D CAP_O_TILDE                    5u 0 inz(280)
     D CAP_O_DIAERESI                 5u 0 inz(280)
     D MULTIPLICATION                 5u 0 inz(280)
     D CAP_O_SLASH                    5u 0 inz(280)
     D CAP_U_GRAVE                    5u 0 inz(280)
     D CAP_U_ACUTE                    5u 0 inz(280)
     D CAP_U_CIRCUMFL                 5u 0 inz(280)
     D CAP_U_DIAERESI                 5u 0 inz(280)
     D CAP_Y_ACUTE                    5u 0 inz(280)
     D CAP_THORN                      5u 0 inz(280)
     D SML_SHARP_S                    5u 0 inz(280)
     D SML_A_GRAVE                    5u 0 inz(280)
     D SML_A_ACUTE                    5u 0 inz(280)
     D SML_A_CIRCUMFL                 5u 0 inz(280)
     D SML_A_TILDE                    5u 0 inz(280)
     D SML_A_DIAERESI                 5u 0 inz(280)
     D SML_A_RING_ABO                 5u 0 inz(280)
     D SML_AE                         5u 0 inz(280)
     D SML_C_CEDILLA                  5u 0 inz(280)
     D SML_E_GRAVE                    5u 0 inz(280)
     D SML_E_ACUTE                    5u 0 inz(280)
     D SML_E_CIRCUMFL                 5u 0 inz(280)
     D SML_E_DIAERESI                 5u 0 inz(280)
     D SML_I_GRAVE                    5u 0 inz(280)
     D SML_I_ACUTE                    5u 0 inz(280)
     D SML_I_CIRCUMFL                 5u 0 inz(280)
     D SML_I_DIAERESI                 5u 0 inz(280)
     D SML_ETH                        5u 0 inz(280)
     D SML_N_TILDE                    5u 0 inz(280)
     D SML_O_GRAVE                    5u 0 inz(280)
     D SML_O_ACUTE                    5u 0 inz(280)
     D SML_O_CIRCUMFL                 5u 0 inz(280)
     D SML_O_TILDE                    5u 0 inz(280)
     D SML_O_DIAERESI                 5u 0 inz(280)
     D DIVISION_SIGN                  5u 0 inz(280)
     D SML_O_SLASH                    5u 0 inz(280)
     D SML_U_GRAVE                    5u 0 inz(280)
     D SML_U_ACUTE                    5u 0 inz(280)
     D SML_U_CIRCUMFL                 5u 0 inz(280)
     D SML_U_DIAERESI                 5u 0 inz(280)
     D SML_Y_ACUTE                    5u 0 inz(280)
     D SML_THORN                      5u 0 inz(280)
     D SML_Y_DIAERESI                 5u 0 inz(280)
     d size                           5u 0 dim(224) overlay(ZAPF)


     d arial           ds           448    qualified
    ? * ArialUnicodeMS
     D SPACE                          5u 0 inz(278 )
     D EXCLAMATION                    5u 0 inz(278 )
     D QUOTATION_MARK                 5u 0 inz(355 )
     D NUMBER_SIGN                    5u 0 inz(556 )
     D DOLLAR_SIGN                    5u 0 inz(556 )
     D PERCENT_SIGN                   5u 0 inz(889 )
     D AMPERSAND                      5u 0 inz(667 )
     D APOSTROPHE                     5u 0 inz(191 )
     D L_PARENTHESIS                  5u 0 inz(333 )
     D R_PARENTHESIS                  5u 0 inz(333 )
     D ASTERISK                       5u 0 inz(389 )
     D PLUS_SIGN                      5u 0 inz(584 )
     D COMMA                          5u 0 inz(278 )
     D HYPHEN_MINUS                   5u 0 inz(333 )
     D PERIOD                         5u 0 inz(278 )
     D SLASH                          5u 0 inz(278 )
     D DIGIT_ZERO                     5u 0 inz(556 )
     D DIGIT_ONE                      5u 0 inz(556 )
     D DIGIT_TWO                      5u 0 inz(556 )
     D DIGIT_THREE                    5u 0 inz(556 )
     D DIGIT_FOUR                     5u 0 inz(556 )
     D DIGIT_FIVE                     5u 0 inz(556 )
     D DIGIT_SIX                      5u 0 inz(556 )
     D DIGIT_SEVEN                    5u 0 inz(556 )
     D DIGIT_EIGHT                    5u 0 inz(556 )
     D DIGIT_NINE                     5u 0 inz(556 )
     D COLON                          5u 0 inz(278 )
     D SEMICOLON                      5u 0 inz(278 )
     D LESS_THAN_SIGN                 5u 0 inz(584 )
     D EQUALS_SIGN                    5u 0 inz(584 )
     D GREATER_THAN                   5u 0 inz(584 )
     D QUESTION_MARK                  5u 0 inz(556 )
     D COMMERCIAL_AT                  5u 0 inz(1015)
     D CAPITAL_A                      5u 0 inz(667 )
     D CAPITAL_B                      5u 0 inz(667 )
     D CAPITAL_C                      5u 0 inz(722 )
     D CAPITAL_D                      5u 0 inz(722 )
     D CAPITAL_E                      5u 0 inz(667 )
     D CAPITAL_F                      5u 0 inz(611 )
     D CAPITAL_G                      5u 0 inz(778 )
     D CAPITAL_H                      5u 0 inz(722 )
     D CAPITAL_I                      5u 0 inz(278 )
     D CAPITAL_J                      5u 0 inz(500 )
     D CAPITAL_K                      5u 0 inz(667 )
     D CAPITAL_L                      5u 0 inz(556 )
     D CAPITAL_M                      5u 0 inz(833 )
     D CAPITAL_N                      5u 0 inz(722 )
     D CAPITAL_O                      5u 0 inz(778 )
     D CAPITAL_P                      5u 0 inz(667 )
     D CAPITAL_Q                      5u 0 inz(778 )
     D CAPITAL_R                      5u 0 inz(722 )
     D CAPITAL_S                      5u 0 inz(667 )
     D CAPITAL_T                      5u 0 inz(611 )
     D CAPITAL_U                      5u 0 inz(722 )
     D CAPITAL_V                      5u 0 inz(667 )
     D CAPITAL_W                      5u 0 inz(944 )
     D CAPITAL_X                      5u 0 inz(667 )
     D CAPITAL_Y                      5u 0 inz(667 )
     D CAPITAL_Z                      5u 0 inz(611 )
     D LEFT_BRACKET                   5u 0 inz(278 )
     D BACKSLASH                      5u 0 inz(750 )
     D RIGHT_BRACKET                  5u 0 inz(278 )
     D CIRCUMFLEX_ACC                 5u 0 inz(469 )
     D UNDERSCORE                     5u 0 inz(500 )
     D GRAVE_ACCENT                   5u 0 inz(333 )
     D SML_A                          5u 0 inz(556 )
     D SML_B                          5u 0 inz(556 )
     D SML_C                          5u 0 inz(500 )
     D SML_D                          5u 0 inz(556 )
     D SML_E                          5u 0 inz(556 )
     D SML_F                          5u 0 inz(278 )
     D SML_G                          5u 0 inz(556 )
     D SML_H                          5u 0 inz(556 )
     D SML_I                          5u 0 inz(222 )
     D SML_J                          5u 0 inz(222 )
     D SML_K                          5u 0 inz(500 )
     D SML_L                          5u 0 inz(222 )
     D SML_M                          5u 0 inz(833 )
     D SML_N                          5u 0 inz(556 )
     D SML_O                          5u 0 inz(556 )
     D SML_P                          5u 0 inz(556 )
     D SML_Q                          5u 0 inz(556 )
     D SML_R                          5u 0 inz(333 )
     D SML_S                          5u 0 inz(500 )
     D SML_T                          5u 0 inz(278 )
     D SML_U                          5u 0 inz(556 )
     D SML_V                          5u 0 inz(500 )
     D SML_W                          5u 0 inz(722 )
     D SML_X                          5u 0 inz(500 )
     D SML_Y                          5u 0 inz(500 )
     D SML_Z                          5u 0 inz(500 )
     D LEFT_BRACE                     5u 0 inz(334 )
     D VERTICAL_LINE                  5u 0 inz(750 )
     D RIGHT_BRACE                    5u 0 inz(334 )
     D ASCIITILDE                     5u 0 inz(750 )
     D DELETE                         5u 0 inz(750 )
     D Euro                           5u 0 inz(750 )
     D x81                            5u 0 inz(750 )
     D x82                            5u 0 inz(750 )
     D florin                         5u 0 inz(750 )
     D quotedblbase                   5u 0 inz(750 )
     D x85                            5u 0 inz(750 )
     D dagger                         5u 0 inz(750 )
     D daggerdbl                      5u 0 inz(750 )
     D circumflex                     5u 0 inz(750 )
     D perthousand                    5u 0 inz(750 )
     D cap_Scaron                     5u 0 inz(750 )
     D guilsinglleft                  5u 0 inz(750 )
     D cap_OE                         5u 0 inz(750 )
     D x8d                            5u 0 inz(750 )
     D cap_Zcaron                     5u 0 inz(750 )
     D x8f                            5u 0 inz(750 )
     D x90                            5u 0 inz(750 )
     D quoteleft                      5u 0 inz(750 )
     D quoteright                     5u 0 inz(750 )
     D quotedblleft                   5u 0 inz(750 )
     D quotedblright                  5u 0 inz(750 )
     D bullet                         5u 0 inz(750 )
     D underline                      5u 0 inz(750 )
     D dbl_underline                  5u 0 inz(750 )
     D tilde                          5u 0 inz(750 )
     D trademark                      5u 0 inz(750 )
     D sml_scaron                     5u 0 inz(750 )
     D guilsinglright                 5u 0 inz(750 )
     D sml_oe                         5u 0 inz(750 )
     D x9d                            5u 0 inz(750 )
     D sml_zcaron                     5u 0 inz(750 )
     D Ydieresis                      5u 0 inz(750 )
     D NO_BREAK_SPACE                 5u 0 inz(278 )
     D INVERTED_EXCLA                 5u 0 inz(750 )
     D CENT_SIGN                      5u 0 inz(750 )
     D POUND_SIGN                     5u 0 inz(750 )
     D CURRENCY_SIGN                  5u 0 inz(750 )
     D YEN_SIGN                       5u 0 inz(750 )
     D BROKEN_BAR                     5u 0 inz(750 )
     D SECTION_SIGN                   5u 0 inz(750 )
     D DIAERESIS                      5u 0 inz(750 )
     D COPYRIGHT_SIGN                 5u 0 inz(750 )
     D FEMININE_ORDIN                 5u 0 inz(750 )
     D L_DBL_QUOTE                    5u 0 inz(750 )
     D NOT_SIGN                       5u 0 inz(180 )
     D SOFT_HYPHEN                    5u 0 inz(750 )
     D REGISTERED                     5u 0 inz(480 )
     D MACRON                         5u 0 inz(280 )
     D DEGREE_SIGN                    5u 0 inz(750 )
     D PLUS_MINUS                     5u 0 inz(750 )
     D SUPER_TWO                      5u 0 inz(680 )
     D SUPER_THREE                    5u 0 inz(680 )
     D ACUTE_ACCENT                   5u 0 inz(750 )
     D MICRO_SIGN                     5u 0 inz(666 )
     D PARAGRAPH_SIGN                 5u 0 inz(750 )
     D MIDDLE_DOT                     5u 0 inz(753 )
     D CEDILLA                        5u 0 inz(550 )
     D SUPER_ONE                      5u 0 inz(770 )
     D MASCULINE_ORDI                 5u 0 inz(285 )
     D R_DBL_QUOTE                    5u 0 inz(750 )
     D ONE_QUARTER                    5u 0 inz(1000)
     D ONE_HALF                       5u 0 inz(720 )
     D THREE_QUARTERS                 5u 0 inz(667 )
     D INVERTED_QUEST                 5u 0 inz(750 )
     D CAP_A_GRAVE                    5u 0 inz(222 )
     D CAP_A_ACUTE                    5u 0 inz(722 )
     D CAP_A_CIRCUMFL                 5u 0 inz(667 )
     D CAP_A_TILDE                    5u 0 inz(610 )
     D CAP_A_DIAERESI                 5u 0 inz(667 )
     D CAP_A_RING_ABO                 5u 0 inz(287 )
     D CAP_AE                         5u 0 inz(1000)
     D CAP_C_CEDILLA                  5u 0 inz(287 )
     D CAP_E_GRAVE                    5u 0 inz(287 )
     D CAP_E_ACUTE                    5u 0 inz(287 )
     D CAP_E_CIRCUMFL                 5u 0 inz(750 )
     D CAP_E_DIAERESI                 5u 0 inz(750 )
     D CAP_I_GRAVE                    5u 0 inz(777 )
     D CAP_I_ACUTE                    5u 0 inz(777 )
     D CAP_I_CIRCUMFL                 5u 0 inz(778 )
     D CAP_I_DIAERESI                 5u 0 inz(778 )
     D CAP_ETH                        5u 0 inz(778 )
     D CAP_N_TILDE                    5u 0 inz(628 )
     D CAP_O_GRAVE                    5u 0 inz(778 )
     D CAP_O_ACUTE                    5u 0 inz(732 )
     D CAP_O_CIRCUMFL                 5u 0 inz(328 )
     D CAP_O_TILDE                    5u 0 inz(750 )
     D CAP_O_DIAERESI                 5u 0 inz(750 )
     D MULTIPLICATION                 5u 0 inz(750 )
     D CAP_O_SLASH                    5u 0 inz(750 )
     D CAP_U_GRAVE                    5u 0 inz(722 )
     D CAP_U_ACUTE                    5u 0 inz(666 )
     D CAP_U_CIRCUMFL                 5u 0 inz(667 )
     D CAP_U_DIAERESI                 5u 0 inz(627 )
     D CAP_Y_ACUTE                    5u 0 inz(500 )
     D CAP_THORN                      5u 0 inz(820 )
     D SML_SHARP_S                    5u 0 inz(666 )
     D SML_A_GRAVE                    5u 0 inz(556 )
     D SML_A_ACUTE                    5u 0 inz(556 )
     D SML_A_CIRCUMFL                 5u 0 inz(556 )
     D SML_A_TILDE                    5u 0 inz(556 )
     D SML_A_DIAERESI                 5u 0 inz(556 )
     D SML_A_RING_ABO                 5u 0 inz(556 )
     D SML_AE                         5u 0 inz(750 )
     D SML_C_CEDILLA                  5u 0 inz(750 )
     D SML_E_GRAVE                    5u 0 inz(448 )
     D SML_E_ACUTE                    5u 0 inz(880 )
     D SML_E_CIRCUMFL                 5u 0 inz(496 )
     D SML_E_DIAERESI                 5u 0 inz(556 )
     D SML_I_GRAVE                    5u 0 inz(556 )
     D SML_I_ACUTE                    5u 0 inz(556 )
     D SML_I_CIRCUMFL                 5u 0 inz(500 )
     D SML_I_DIAERESI                 5u 0 inz(278 )
     D SML_ETH                        5u 0 inz(278 )
     D SML_N_TILDE                    5u 0 inz(278 )
     D SML_O_GRAVE                    5u 0 inz(276 )
     D SML_O_ACUTE                    5u 0 inz(556 )
     D SML_O_CIRCUMFL                 5u 0 inz(556 )
     D SML_O_TILDE                    5u 0 inz(556 )
     D SML_O_DIAERESI                 5u 0 inz(556 )
     D DIVISION_SIGN                  5u 0 inz(750 )
     D SML_O_SLASH                    5u 0 inz(750 )
     D SML_U_GRAVE                    5u 0 inz(760 )
     D SML_U_ACUTE                    5u 0 inz(750 )
     D SML_U_CIRCUMFL                 5u 0 inz(750 )
     D SML_U_DIAERESI                 5u 0 inz(450 )
     D SML_Y_ACUTE                    5u 0 inz(620 )
     D SML_THORN                      5u 0 inz(590 )
     D SML_Y_DIAERESI                 5u 0 inz(555 )
     d size                           5u 0 dim(224) overlay(arial)

     d PiStd           ds           448    qualified
    ? * AdobePiStd, basé sur KozMinPr6N-Regular
     D SPACE                          5u 0 inz(224    )
     D EXCLAMATION                    5u 0 inz(266    )
     D QUOTATION_MARK                 5u 0 inz(392    )
     D NUMBER_SIGN                    5u 0 inz(551    )
     D DOLLAR_SIGN                    5u 0 inz(562    )
     D PERCENT_SIGN                   5u 0 inz(883    )
     D AMPERSAND                      5u 0 inz(677    )
     D APOSTROPHE                     5u 0 inz(213    )
     D L_PARENTHESIS                  5u 0 inz(322    )
     D R_PARENTHESIS                  5u 0 inz(322    )
     D ASTERISK                       5u 0 inz(470    )
     D PLUS_SIGN                      5u 0 inz(677    )
     D COMMA                          5u 0 inz(247    )
     D HYPHEN_MINUS                   5u 0 inz(343    )
     D PERIOD                         5u 0 inz(245    )
     D SLASH                          5u 0 inz(370    )
     D DIGIT_ZERO                     5u 0 inz(562    )
     D DIGIT_ONE                      5u 0 inz(562    )
     D DIGIT_TWO                      5u 0 inz(562    )
     D DIGIT_THREE                    5u 0 inz(562    )
     D DIGIT_FOUR                     5u 0 inz(562    )
     D DIGIT_FIVE                     5u 0 inz(562    )
     D DIGIT_SIX                      5u 0 inz(562    )
     D DIGIT_SEVEN                    5u 0 inz(562    )
     D DIGIT_EIGHT                    5u 0 inz(562    )
     D DIGIT_NINE                     5u 0 inz(562    )
     D COLON                          5u 0 inz(245    )
     D SEMICOLON                      5u 0 inz(247    )
     D LESS_THAN_SIGN                 5u 0 inz(677    )
     D EQUALS_SIGN                    5u 0 inz(677    )
     D GREATER_THAN                   5u 0 inz(677    )
     D QUESTION_MARK                  5u 0 inz(447    )
     D COMMERCIAL_AT                  5u 0 inz(808    )
     D CAPITAL_A                      5u 0 inz(661    )
     D CAPITAL_B                      5u 0 inz(602    )
     D CAPITAL_C                      5u 0 inz(610    )
     D CAPITAL_D                      5u 0 inz(708    )
     D CAPITAL_E                      5u 0 inz(535    )
     D CAPITAL_F                      5u 0 inz(528    )
     D CAPITAL_G                      5u 0 inz(689    )
     D CAPITAL_H                      5u 0 inz(703    )
     D CAPITAL_I                      5u 0 inz(275    )
     D CAPITAL_J                      5u 0 inz(404    )
     D CAPITAL_K                      5u 0 inz(602    )
     D CAPITAL_L                      5u 0 inz(514    )
     D CAPITAL_M                      5u 0 inz(871    )
     D CAPITAL_N                      5u 0 inz(708    )
     D CAPITAL_O                      5u 0 inz(727    )
     D CAPITAL_P                      5u 0 inz(585    )
     D CAPITAL_Q                      5u 0 inz(727    )
     D CAPITAL_R                      5u 0 inz(595    )
     D CAPITAL_S                      5u 0 inz(539    )
     D CAPITAL_T                      5u 0 inz(541    )
     D CAPITAL_U                      5u 0 inz(696    )
     D CAPITAL_V                      5u 0 inz(619    )
     D CAPITAL_W                      5u 0 inz(922    )
     D CAPITAL_X                      5u 0 inz(612    )
     D CAPITAL_Y                      5u 0 inz(591    )
     D CAPITAL_Z                      5u 0 inz(584    )
     D LEFT_BRACKET                   5u 0 inz(322    )
     D BACKSLASH                      5u 0 inz(1000   )
     D RIGHT_BRACKET                  5u 0 inz(322    )
     D CIRCUMFLEX_ACC                 5u 0 inz(677    )
     D UNDERSCORE                     5u 0 inz(568    )
     D GRAVE_ACCENT                   5u 0 inz(340    )
     D SML_A                          5u 0 inz(532    )
     D SML_B                          5u 0 inz(612    )
     D SML_C                          5u 0 inz(475    )
     D SML_D                          5u 0 inz(608    )
     D SML_E                          5u 0 inz(543    )
     D SML_F                          5u 0 inz(332    )
     D SML_G                          5u 0 inz(603    )
     D SML_H                          5u 0 inz(601    )
     D SML_I                          5u 0 inz(265    )
     D SML_J                          5u 0 inz(276    )
     D SML_K                          5u 0 inz(524    )
     D SML_L                          5u 0 inz(264    )
     D SML_M                          5u 0 inz(901    )
     D SML_N                          5u 0 inz(601    )
     D SML_O                          5u 0 inz(590    )
     D SML_P                          5u 0 inz(612    )
     D SML_Q                          5u 0 inz(607    )
     D SML_R                          5u 0 inz(367    )
     D SML_S                          5u 0 inz(433    )
     D SML_T                          5u 0 inz(369    )
     D SML_U                          5u 0 inz(597    )
     D SML_V                          5u 0 inz(527    )
     D SML_W                          5u 0 inz(800    )
     D SML_X                          5u 0 inz(511    )
     D SML_Y                          5u 0 inz(518    )
     D SML_Z                          5u 0 inz(468    )
     D LEFT_BRACE                     5u 0 inz(321    )
     D VERTICAL_LINE                  5u 0 inz(1000   )
     D RIGHT_BRACE                    5u 0 inz(321    )
     D ASCIITILDE                     5u 0 inz(1000   )
     D DELETE                         5u 0 inz(1000   )
     D Euro                           5u 0 inz(1000   )
     D x81                            5u 0 inz(1000   )
     D x82                            5u 0 inz(1000   )
     D florin                         5u 0 inz(1000   )
     D quotedblbase                   5u 0 inz(1000   )
     D x85                            5u 0 inz(1000   )
     D dagger                         5u 0 inz(1000   )
     D daggerdbl                      5u 0 inz(1000   )
     D circumflex                     5u 0 inz(1000   )
     D perthousand                    5u 0 inz(1000   )
     D cap_Scaron                     5u 0 inz(1000   )
     D guilsinglleft                  5u 0 inz(1000   )
     D cap_OE                         5u 0 inz(1000   )
     D x8d                            5u 0 inz(1000   )
     D cap_Zcaron                     5u 0 inz(1000   )
     D x8f                            5u 0 inz(1000   )
     D x90                            5u 0 inz(1000   )
     D quoteleft                      5u 0 inz(1000   )
     D quoteright                     5u 0 inz(1000   )
     D quotedblleft                   5u 0 inz(1000   )
     D quotedblright                  5u 0 inz(1000   )
     D bullet                         5u 0 inz(1000   )
     D underline                      5u 0 inz(1000   )
     D dbl_underline                  5u 0 inz(1000   )
     D tilde                          5u 0 inz(1000   )
     D trademark                      5u 0 inz(1000   )
     D sml_scaron                     5u 0 inz(1000   )
     D guilsinglright                 5u 0 inz(1000   )
     D sml_oe                         5u 0 inz(1000   )
     D x9d                            5u 0 inz(1000   )
     D sml_zcaron                     5u 0 inz(1000   )
     D Ydieresis                      5u 0 inz(1000   )
     D NO_BREAK_SPACE                 5u 0 inz(224    )
     D INVERTED_EXCLA                 5u 0 inz(1000   )
     D CENT_SIGN                      5u 0 inz(1000   )
     D POUND_SIGN                     5u 0 inz(1000   )
     D CURRENCY_SIGN                  5u 0 inz(1000   )
     D YEN_SIGN                       5u 0 inz(1000   )
     D BROKEN_BAR                     5u 0 inz(1000   )
     D SECTION_SIGN                   5u 0 inz(1000   )
     D DIAERESIS                      5u 0 inz(1000   )
     D COPYRIGHT_SIGN                 5u 0 inz(1000   )
     D FEMININE_ORDIN                 5u 0 inz(1000   )
     D L_DBL_QUOTE                    5u 0 inz(1000   )
     D NOT_SIGN                       5u 0 inz(267    )
     D SOFT_HYPHEN                    5u 0 inz(1000   )
     D REGISTERED                     5u 0 inz(1000   )
     D MACRON                         5u 0 inz(215    )
     D DEGREE_SIGN                    5u 0 inz(1000   )
     D PLUS_MINUS                     5u 0 inz(1000   )
     D SUPER_TWO                      5u 0 inz(666    )
     D SUPER_THREE                    5u 0 inz(666    )
     D ACUTE_ACCENT                   5u 0 inz(1000   )
     D MICRO_SIGN                     5u 0 inz(666    )
     D PARAGRAPH_SIGN                 5u 0 inz(1000   )
     D MIDDLE_DOT                     5u 0 inz(1000   )
     D CEDILLA                        5u 0 inz(1000   )
     D SUPER_ONE                      5u 0 inz(1000   )
     D MASCULINE_ORDI                 5u 0 inz(222    )
     D R_DBL_QUOTE                    5u 0 inz(1000   )
     D ONE_QUARTER                    5u 0 inz(750    )
     D ONE_HALF                       5u 0 inz(700    )
     D THREE_QUARTERS                 5u 0 inz(530    )
     D INVERTED_QUEST                 5u 0 inz(1000   )
     D CAP_A_GRAVE                    5u 0 inz(400    )
     D CAP_A_ACUTE                    5u 0 inz(550    )
     D CAP_A_CIRCUMFL                 5u 0 inz(540    )
     D CAP_A_TILDE                    5u 0 inz(470    )
     D CAP_A_DIAERESI                 5u 0 inz(521    )
     D CAP_A_RING_ABO                 5u 0 inz(380    )
     D CAP_AE                         5u 0 inz(1000   )
     D CAP_C_CEDILLA                  5u 0 inz(275    )
     D CAP_E_GRAVE                    5u 0 inz(275    )
     D CAP_E_ACUTE                    5u 0 inz(275    )
     D CAP_E_CIRCUMFL                 5u 0 inz(550    )
     D CAP_E_DIAERESI                 5u 0 inz(550    )
     D CAP_I_GRAVE                    5u 0 inz(700    )
     D CAP_I_ACUTE                    5u 0 inz(700    )
     D CAP_I_CIRCUMFL                 5u 0 inz(720    )
     D CAP_I_DIAERESI                 5u 0 inz(720    )
     D CAP_ETH                        5u 0 inz(1000   )
     D CAP_N_TILDE                    5u 0 inz(727    )
     D CAP_O_GRAVE                    5u 0 inz(750    )
     D CAP_O_ACUTE                    5u 0 inz(1000   )
     D CAP_O_CIRCUMFL                 5u 0 inz(677    )
     D CAP_O_TILDE                    5u 0 inz(1000   )
     D CAP_O_DIAERESI                 5u 0 inz(1000   )
     D MULTIPLICATION                 5u 0 inz(1000   )
     D CAP_O_SLASH                    5u 0 inz(1000   )
     D CAP_U_GRAVE                    5u 0 inz(696    )
     D CAP_U_ACUTE                    5u 0 inz(586    )
     D CAP_U_CIRCUMFL                 5u 0 inz(600    )
     D CAP_U_DIAERESI                 5u 0 inz(600    )
     D CAP_Y_ACUTE                    5u 0 inz(611    )
     D CAP_THORN                      5u 0 inz(740    )
     D SML_SHARP_S                    5u 0 inz(660    )
     D SML_A_GRAVE                    5u 0 inz(532    )
     D SML_A_ACUTE                    5u 0 inz(532    )
     D SML_A_CIRCUMFL                 5u 0 inz(532    )
     D SML_A_TILDE                    5u 0 inz(532    )
     D SML_A_DIAERESI                 5u 0 inz(532    )
     D SML_A_RING_ABO                 5u 0 inz(532    )
     D SML_AE                         5u 0 inz(1000   )
     D SML_C_CEDILLA                  5u 0 inz(1000   )
     D SML_E_GRAVE                    5u 0 inz(1000   )
     D SML_E_ACUTE                    5u 0 inz(1000   )
     D SML_E_CIRCUMFL                 5u 0 inz(463    )
     D SML_E_DIAERESI                 5u 0 inz(543    )
     D SML_I_GRAVE                    5u 0 inz(540    )
     D SML_I_ACUTE                    5u 0 inz(814    )
     D SML_I_CIRCUMFL                 5u 0 inz(264    )
     D SML_I_DIAERESI                 5u 0 inz(264    )
     D SML_ETH                        5u 0 inz(264    )
     D SML_N_TILDE                    5u 0 inz(264    )
     D SML_O_GRAVE                    5u 0 inz(264    )
     D SML_O_ACUTE                    5u 0 inz(580    )
     D SML_O_CIRCUMFL                 5u 0 inz(590    )
     D SML_O_TILDE                    5u 0 inz(590    )
     D SML_O_DIAERESI                 5u 0 inz(590    )
     D DIVISION_SIGN                  5u 0 inz(1000   )
     D SML_O_SLASH                    5u 0 inz(666    )
     D SML_U_GRAVE                    5u 0 inz(1000   )
     D SML_U_ACUTE                    5u 0 inz(1000   )
     D SML_U_CIRCUMFL                 5u 0 inz(1000   )
     D SML_U_DIAERESI                 5u 0 inz(333    )
     D SML_Y_ACUTE                    5u 0 inz(1000   )
     D SML_THORN                      5u 0 inz(600    )
     D SML_Y_DIAERESI                 5u 0 inz(600    )
     d size                           5u 0 dim(224) overlay(pistd)

     d font            ds           448    qualified based(pFont)
     d size                           5u 0 dim(224)

    ?D*cmpdta1         DS
    ? *
    ?D*                              29A   INZ(' !"#$%&''()*+,-./0123456789:;<')
    ?D*                              30A   INZ('=>?@ABCDEFGHIJKLMNOPQRSTUVWXYZ')
    ?D*                              30A   INZ('[\]^_`abcdefghijklmnopqrstuvwx')
    ?D*                              30A   INZ('yz{|}~¢£¤¥¦§¨©ª«¬­®¯°±²³´µ¶·¸¹')
    ?D*                              30A   INZ('º»¼½¾¿ÀÁÂÃÄÅÆÇÈÉÊËÌÍÎÏÐÑÒÓÔÕÖ×')
    ?D*                              30A   INZ('ØÙÚÛÜÝÞßàáâãäåæçèéêëìíîïðñòóôõ')
    ?D*                              11A   INZ('ö÷øùúûüýþÿ¡')
    ? *
    ?D*ARCHAR                         1A   OVERLAY(cmpdta1) DIM(190)
    ? *
    ? * taille en 1/1000 de point du caractère en fontsize=1
    ? *                                           1  2  3  4  5  6  7  8  9  0  1234567890
    ?D*helvP           DS
    ?D*                              30A   INZ('278278355556556889667190333333') !"#$%&'()
    ?D*                              30A   INZ('389584278333278278556556556556')*+,-./0123
    ?D*                              30A   INZ('556556556556556556278278584584')456789:;<=
    ?D*                              30A   INZ('584556999667667722722667611778')>?@ABCDEFG
    ?D*                              30A   INZ('722278500667556833722778667778')HIJKLMNOPQ
    ?D*                              30A   INZ('722667611722667944667667611278')RSTUVWXYZ[
    ?D*                              30A   INZ('278278469556335556556500556556')\]^_`abcde
    ?D*                              30A   INZ('278556556222222500222833556556')fghijklmno
    ?D*                              30A   INZ('556556333500278556500722500500')pqrstuvwxy
    ?D*                              30A   INZ('500334260334584556556556556260')z{|}~¢£¤¥¦
    ?D*                              30A   INZ('556333737370556584333737333400')§¨©ª«¬­®¯°
    ?D*                              30A   INZ('584333333333556537278333333365')±²³´µ¶·¸¹º
    ?D*                              30A   INZ('556834834834611667667667667667')»¼½¾¿ÀÁÂÃÄ
    ?D*                              30A   INZ('667999722667667667667278278278')ÅÆÇÈÉÊËÌÍÎ
    ?D*                              30A   INZ('278722722778778778778778584778')ÏÐÑÒÓÔÕÖ×Ø
    ?D*                              30A   INZ('722722722722667667611556556556')ÙÚÛÜÝÞßàáâ
    ?D*                              30A   INZ('556556556889500556556556556278')ãäåæçèéêëì
    ?D*                              30A   INZ('278278278556556556556556556556')íîïðñòóôõö
    ?D*                              30A   INZ('584611556556556556500500556278')÷øùúûüýþÿ¡
    ? *
    ?D*ARHELVP                        3A   OVERLAY(helvP)   DIM(190)
    ? *                                           1  2  3  4  5  6  7  8  9  0  1234567890
    ?D*helvB           DS                                                       1234567890
    ?D*                              30A   INZ('278333474556556889722238333333') !"#$%&'()
    ?D*                              30A   INZ('389584278333278278556556556556')*+,-./0123
    ?D*                              30A   INZ('556556556556556556333333584584')456789:;<=
    ?D*                              30A   INZ('584611975722722722722667611778')>?@ABCDEFG
    ?D*                              30A   INZ('722278556722611833722778667778')HIJKLMNOPQ
    ?D*                              30A   INZ('722667611722667944667667611333')RSTUVWXYZ[
    ?D*                              30A   INZ('278333584556333556611556611556')\]^_`abcde
    ?D*                              30A   INZ('333611611278278556278889611611')fghijklmno
    ?D*                              30A   INZ('611611389556333611556778556556')pqrstuvwxy
    ?D*                              30A   INZ('500389280389584556556556556280')z{|}~¢£¤¥¦
    ?D*                              30A   INZ('556333737370556584333737333400')§¨©ª«¬­®¯°
    ?D*                              30A   INZ('584333333333611556278333333365')±²³´µ¶·¸¹º
    ?D*                              30A   INZ('556834834834611722722722722556')»¼½¾¿ÀÁÂÃÄ
    ?D*                              30A   INZ('722999722667667667667278278278')ÅÆÇÈÉÊËÌÍÎ
    ?D*                              30A   INZ('278722722778778778778778584778')ÏÐÑÒÓÔÕÖ×Ø
    ?D*                              30A   INZ('722722722722667611611556556556')ÙÚÛÜÝÞßàáâ
    ?D*                              30A   INZ('556556556889556556556556556278')ãäåæçèéêëì
    ?D*                              30A   INZ('278278278611611611611611611611')íîïðñòóôõö
    ?D*                              30A   INZ('584611611611611611556611556333')÷øùúûüýþÿ¡
    ? *
    ?D*ARHELVB                        3A   OVERLAY(helvB)   DIM(190)
    ? *                                           1  2  3  4  5  6  7  8  9  0  1234567890
    ?D*helvI           DS                                                       1234567890
    ?D*                              30A   INZ('278278355556556889667190333333') !"#$%&'()
    ?D*                              30A   INZ('389584278333278278556556556556')*+,-./0123
    ?D*                              30A   INZ('556556556556556556278278584584')456789:;<=
    ?D*                              30A   INZ('584556999667667722722667611778')>?@ABCDEFG
    ?D*                              30A   INZ('722278500667556833722778667778')HIJKLMNOPQ
    ?D*                              30A   INZ('722667611722667944667667611278')RSTUVWXYZ[
    ?D*                              30A   INZ('278278469556380556556500556556')\]^_`abcde
    ?D*                              30A   INZ('278556556222222500222833556556')fghijklmno
    ?D*                              30A   INZ('556556333500278556500722500500')pqrstuvwxy
    ?D*                              30A   INZ('500334260334584556556556556260')z{|}~¢£¤¥¦
    ?D*                              30A   INZ('556333737370556584333737333400')§¨©ª«¬­®¯°
    ?D*                              30A   INZ('584333333333556537278333333365')±²³´µ¶·¸¹º
    ?D*                              30A   INZ('556834834834611667667667667556')»¼½¾¿ÀÁÂÃÄ
    ?D*                              30A   INZ('667999722667667667667278278278')ÅÆÇÈÉÊËÌÍÎ
    ?D*                              30A   INZ('278722722778778778778778584778')ÏÐÑÒÓÔÕÖ×Ø
    ?D*                              30A   INZ('722722722722667556611556556556')ÙÚÛÜÝÞßàáâ
    ?D*                              30A   INZ('556556556889500556556556556278')ãäåæçèéêëì
    ?D*                              30A   INZ('278278278556556556556556556556')íîïðñòóôõö
    ?D*                              30A   INZ('584611556556556556500555500380')÷øùúûüýþÿ¡
    ? *
    ?D*ARHELVI                        3A   OVERLAY(helvI)   DIM(190)
    ? *                                           1  2  3  4  5  6  7  8  9  0  1234567890
    ?D*helvBI          DS                                                       1234567890
    ?D*                              30A   INZ('278333474556556889722228333333') !"#$%&'()
    ?D*                              30A   INZ('389584278333278278556556556556')*+,-./0123
    ?D*                              30A   INZ('556556556556556556333333584584')456789:;<=
    ?D*                              30A   INZ('584611975722722722722667611778')>?@ABCDEFG
    ?D*                              30A   INZ('722278556722611833722778667778')HIJKLMNOPQ
    ?D*                              30A   INZ('722667611722667944667667611333')RSTUVWXYZ[
    ?D*                              30A   INZ('278333584556333556611556611556')\]^_`abcde
    ?D*                              30A   INZ('333611611278278556278889611611')fghijklmno
    ?D*                              30A   INZ('611611389556333611556778556556')pqrstuvwxy
    ?D*                              30A   INZ('500389280389584556556556556280')z{|}~¢£¤¥¦
    ?D*                              30A   INZ('556333737370556584333737333400')§¨©ª«¬­®¯°
    ?D*                              30A   INZ('584333333333611556278333333365')±²³´µ¶·¸¹º
    ?D*                              30A   INZ('556834834834611722722722722556')»¼½¾¿ÀÁÂÃÄ
    ?D*                              30A   INZ('722999722667667667667278278278')ÅÆÇÈÉÊËÌÍÎ
    ?D*                              30A   INZ('278722722778778778778778584778')ÏÐÑÒÓÔÕÖ×Ø
    ?D*                              30A   INZ('722722722722667611611556556556')ÙÚÛÜÝÞßàáâ
    ?D*                              30A   INZ('556556556889556556556556556278')ãäåæçèéêëì
    ?D*                              30A   INZ('278278278611611611611611611611')íîïðñòóôõö
    ?D*                              30A   INZ('584611611611611611556667556333')÷øùúûüýþÿ¡
    ? *
    ?D*ARHELVBI                       3A   OVERLAY(helvBI)  DIM(190)

    ? *=------------------------------------------------------------------------------------------=*
     D PdfWrite        pr
     D  data                               const like(pdfbuffer)
     D PdfBinWrite     pr            10i 0
     D  data                               const like(pdfbuffer)
     D  binmode                       5u 0 const
     D PdfFlush        pr

     d pdfEncode85     pr                  like(PdfS3)
     d    in85                             like(PdfS3)

     D PdfOpen         pr
     D  FileName                    512a   varying const
     d  p_OpenMode                   10i 0 const

     d PdfSymbolize    pr                  like(pdfs3)
     d  VarName                            like(pdfs3) const
     d  Diacritic                     1    const
     d  NamedSymbol                  25    const varying

     d PdfSymbolize2   pr                  like(pdfs3)
     d  VarName                            like(pdfs3) const


    ? * returns char representation of any hexadecimal string
     D Chr2Hex         Pr                  ExtProc('cvthc')
     D  Tgt                       65534A   Options(*VarSize)
     D  Src                       32767A   Options(*VarSize)
     D  TgtLen                       10i 0 Value
    ? * and the reverse function
     D Hex2Chr         Pr                  ExtProc('cvtch')
     D  Tgt                       32767A   Options(*VarSize)
     D  Src                       65534A   Options(*VarSize)
     D  SrcLen                       10i 0 Value

     DTblAscii         s            256

     DInzTblAscii      PR           256

       //?xlateb MI
     Dxlateb           PR                  EXTPROC('_XLATEB')
     D  inoutstring                    *   VALUE
     D  table256chars                  *   VALUE
     D  inoutlen                     10U 0 VALUE

       //?Encryption APIs

     D md5hash         PR            16
     D  seq                           1    CONST
     D  msg                         128    CONST
     D  len                           5u 0 CONST

     D RC4Encrypt      PR         65535
     D  msg                       65535    CONST
     D  key                          16    CONST
     D  msgsize                       5u 0 CONST
     D  KeySize                       5u 0 CONST
     D
     D Pad             PR            32
     D  Pwd                          32    CONST
     D  PadString                    32    CONST

     D XOR             PR            16
     D  Key                          16    Const
     D  Counter                       3u 0 Const

     D compute_keys    PR            64
     D  Revision                      1    Const
     D  FileID                       16    Const
     D  Permissions                   5  0 Const
     D  UserPassword                 32    Const
     D  OwnerPassword                32    Const





     D PdfEncrypt      Pr                  like(pdfs3)
     D Buffer                              like(pdfs3) value

     D PDF_Encrypt     Pr         65535A
     D lRevision                      1A   const
     D Buffer                     65535A   value
     D Len                           10i 0 value
     D Object                        10i 0 value
     D lEncryptionKey                16a   value

     d pdfNewObj       pr                  like(PdfObj)

     d PdfWObj         pr                  like(pdfs1)
     d   Obj                               like(PdfObj) const

    ? * deprecated functions : prototype are present here, but not exported.
    ? * I will remove then an other day

     d PdfDrawRestoreGraphicState...
     d                 pr                  like(pdfs1)

     d PdfDrawSaveGraphicState...
     d                 pr                  like(pdfs1)

     d PdfTextRestoreGraphicState...
     d                 pr                  like(pdfs1)

     d PdfTextSaveGraphicState...
     d                 pr                  like(pdfs1)

     d PdfProcSetAdd   pr
     d   theProcSet                        likeds(pdfProcSet)
     d   Theproc                           like(pdfS1) const

     dBmpLoad          pr            10i 0
     D TheImage                            likeds(PdfImage)
     d ToMem                           n   const

     dJpgLoad          pr            10i 0
     D TheImage                            likeds(PdfImage)
     d ToMem                          1    const





     d pdfMemBMP24     pr                  likeds(PdfImage)
     D  anImage                            likeds(PdfImage)
     d pdfLoadJPEGh    pr                  likeds(PdfImage)
     D  FileName                    512a   varying const
     d pdfLoadJPEG     pr                  likeds(PdfImage)
     D  FileName                    512a   varying const
     d pdfMemJPEG      pr                  likeds(PdfImage)
     D  anImage                            likeds(PdfImage)





     D RC              S             10i 0
     D myFilnam        S            512a   varying
     d myImage         S                   like(pdfs3)
    ? * retrieve product info
    ?D*RtvPrdInf       PR                  ExtPgm('QSZRTVPR')
    ?d* RESULT                      128
    ?d* RSTLEN                       10i 0       const
    ?d* FORMAT                        8          const
    ?d* OSINFO                       27          const
    ?d*  Error_Code                 256          options(*varsize)
    ? *
    ?d*APIlen          s             10i 0
    ?d*APIformat       s              8
    ?d* OSINFO         s             27
    ? *
    ?d*PRDR0100        ds           128    qualified
    ?d*Bytes_returned                10i 0
    ?d*Bytes_avail                   10i 0
    ?d*Reserved1                     10i 0
    ?d*Product_ID                     7
    ?d*Release_level                  6
    ?d*Product_option                 4
    ?d*Load_ID                        4
    ?d*Load_type                     10
    ?d*Sym_state                     10
    ?d*Load_error_ind                10
    ?d*Load_state                     2
    ?d*Supported_flag                 1
    ?d*Registr_type                   2
    ?d*Registr_value                 14
    ?d*Reserved2                      2
    ?d*more_info                     10i 0
    ?d*Prim_language                  4
    ?d*Min_release                    6
    ?d*Min_VRM                        6
    ?d*Mixed_Releases                 1
    ?d*Level                          3

    ?d*convccsid       pr           100    varying                              OutString
    ?d*                              10i 0 const                                InCcsid
    ?d*                              10i 0 const                                OutCcsid
    ?d*                             100    const varying                        InString

     d PdfInit         ds                  qualified
     d   NeedInit                      n   inz(*on)
     d   OSversion                         like(prdr0100.Release_level)

     d base85          ds            85    qualified
     d   char                         1    dim(85)
    ?d* The ASCII base-85 encoding uses the characters | through u and the character z,
    ?d* with the 2-character sequence ¨> as its EOD marker
     d base85_1252     s             85    inz(x'-
     d                                     2122232425262728292a2b2c2d2e2f-
     d                                     303132333435363738393a3b3c3d3e3f-
     d                                     404142434445464748494a4b4c4d4e4f-
     d                                     505152535455565758595a5b5c5d5e5f-
     d                                     606162636465666768696a6b6c6d6e6f-
     d                                     707172737475')

     d PdfFile_Xref    pr
     d   obj                               like(PdfObj)       const
     d   ByteCount                         like(PdfBytesCount) const
     d PdfPages_kids   pr
     d   count                             like(PdfObj)       const
     d   obj                               like(Pdfobj)        const

     d PdfRandomize    pr
     d   randomize                     n

     d Random          pr                  extproc('CEERAN0')
     d  seed                         10i 0
     d  number                        8f
     d  feedback                     12a   options(*omit  )

     d testpdfa        s               n   inz(*off)

     d PdfTextStrlen1252...
     d                 pr             8f
     d  Str                                like(pdfs2) const
     d  fntSiz                             like(PdfFontSize)
     d                                     options(*nopass) const
     d  fnt                                likeds(PdfFont)
     d                                     options(*nopass) const

     d U16A            pr                  like(PdfS2)
     d thestream                           like(pdfS2) const
     d fontmetrics_t   ds                  qualified based(template)
     d  AvgWidth                      5i 0
     d  FontWeight                    5i 0
     d  FirstChar                     5i 0
     d  LastChar                      5u 0
     d  Ascent                        5i 0
     d  Descent                       5i 0
     d  NumGlyphs                     5i 0
     d  IndexToLocFmt                 5i00
     d  xMin                          5i00
     d  yMin                          5i00
     d  xMax                          5i00
     d  yMax                          5i00
     d  nbrHMetrics                   5i00
     d  BaseFont                     50    varying
     d  CapsHeight                    5i00
     d  Flags                        10u00
     d  StemV                         5i00
     d  ItalicAngle                   5i00
     d  IsUnicode                     5i00
     d  MissingWidth                  5i00
     d  FlateDecode                  10
     d  EmbedFont                    10
     d  FontSubset                   10
    ?d* ttf ou ttf.z
     d  TtfFile                     500    varying
     d  TtfFileSize                  10u00
    ?d* ctg ou ctg.z
     d  CtgFile                     500    varying
     d  CtgFileSize                  10u00
     d  Cmap                      10000    varying
     d  CIDSystemInfo             10000    varying
     d*bidi from jp4pdf_b
     d bidi            pr                  extproc('bidi')
     d   ustring                       *   value
     d   len                         10i00 value
     d   bc                            *   value
     d   bmg                           *   value
     d bidi_p1         s               *
     d bidi_p3         s               *
     d bidi_p4         s               *
     d gsub            pr
     d  font                               likeds(pdffont)
     d  thestring                          like(pdfu2)
     d getbytes        pr
     d   mem                           *   value
     d   ifs                               likeds(ifs_t)
     d   pos                         10i 0 const
     d   len                         10i 0 const
     d ifs_t           ds                  qualified based(template)
     d  name                               like(pdfs1)
     D  FileHandleA                  10i 0
     d  AsciiRead                    10i 0
     d  AsciiTo                      10i 0
     d*CheckBC         pr
     d*  fromglyf                     5u00
     d*  toglyf                       5u00
     d*  thefont                           likeds(pdffont)

