             CMD        PROMPT('Retrieve cross references')

             PARM       KWD(LIB) TYPE(*NAME) MIN(1) MAX(300) +
                          PROMPT('Libraries to scan')
             PARM       KWD(CURLIB) TYPE(*NAME) MIN(1) +
                          PROMPT('Dedicated Library for XREF')



